[{"pergunta":"Analise as afirmações abaixo:\n \nI - Normalmente os fabricantes deixam arquivos (binários) disponíveis no site, e também programas para realizar o Upgrade;\nII - A memória flash utilizada na BIOS, possui um limite máximo de atualização, que está diretamente ligada a sua capacidade de armazenamento;\nIII - Cada modelo de placa-mãe possui uma BIOS especifica;\nIV - A atualização dura poucos minutos em geral, o problema é se houver alguma interrupção durante o Upgrade, a BIOS não funcionará mais, tornando a placa-mãe inutilizável.\n \nEscolha a opção correta abaixo:\n ","imagem":"","alternativas":"Escolha uma:\na. Todas as afirmações são verdadeiras\nb. A afirmação IV é falsa e todas as outras são verdadeiras\nc. Todas as afirmações são falsas\nd. A afirmação II é falsa e todas as outras são verdadeiras\ne. A afirmação III é falsa e todas as outras são verdadeiras","resposta":"A resposta correta é: A afirmação II é falsa e todas as outras são verdadeiras."},{"pergunta":"O Uso de mais Discos possibilita um aumento do throughput;\nUtiliza 3 ou + discos;\nUm único de Disco de paridade pode ser um problema de gargalo na performance;\nProteção contra falha de Disco com razão de 1 para vários;\nA Performance é degradada durante o acesso, e especificamente durante a reconstrução em caso de falha (rebuild) de um disco rígido (demorando horas).\n \nSão características técnicas do RAID:","imagem":"","alternativas":"Escolha uma:\na. 6\nb. 5\nc. 4\nd. 1\ne. 3","resposta":"A resposta correta é: 3."},{"pergunta":"A função do  ____a____ da BIOS é deixar o equipamento compatível com recursos e corrigir algum ___b___ existente.\n \n ","imagem":"","alternativas":"Escolha uma:\na. a -Dowgrade  b-BUG\nb. a -Dowgrade  b-problema\nc. a -Reset  b-BUG\nd. a -processamento  b-BUG\ne. a -Upgrade  b-BUG","resposta":"A resposta correta é: a -Upgrade  b-BUG."},{"pergunta":"No ___a___ , as configurações de ___b___  estão relacionadas à frequência de operação e tensão do processador e memória.\n\n \n\nEscolha a opção correta que completa as lacuna (a) e (b):\n\n \n\n ","imagem":"","alternativas":"Escolha uma:\na. a - Setup, b - overclocking\nb. a - Setup, b -  erro\nc. a - Processador, b - overclocking\nd. a - Bios, b - boot\ne. a - Setup, b - boot","resposta":"A resposta correta é: a - Setup, b - overclocking."},{"pergunta":"Quando os dados são espelhados através de grupos de discos segmentados, isto é, os dados são primeiro segmentados e para cada segmento criado é feito um espelho, estamos nos referindo ao RAID:\n","imagem":"","alternativas":"Escolha uma:\na. 60\nb. 01\nc. 100\nd. 10\ne. 50","resposta":"A resposta correta é: 01."},{"pergunta":"Utiliza 8 ou + discos;\nImplementa-se um RAID via software sobre outro RAID via Hardware.\n \nEstas características são do RAID:","imagem":"","alternativas":"Escolha uma:\na. 40\nb. 30\nc. 50\nd. 100\ne. 60","resposta":"A resposta correta é: 100."},{"pergunta":"Uso de múltiplos Discos para a formação de um único Disco lógico;\nAlta performance na Escrita e Leitura (Write and Read) performance relacionada com o aumento da quantidade de Discos;\nOs Discos Rígidos são distribuídos utilizando-se uma tamanho definido de “stripe” durante a configuração.\n \nSão características do RAID:","imagem":"","alternativas":"Escolha uma:\na. 0\nb. 10\nc. 1\nd. 5\ne. 50","resposta":"A resposta correta é: 0."},{"pergunta":"O Teste de velocidade de escrita e leitura está relacionado diretamente ao:","imagem":"","alternativas":"Escolha uma:\na. Placa Mãe\nb. Memória RAM\nc. Placa de vídeo\nd. Processador\ne. H.D.","resposta":"A resposta correta é: H.D.."},{"pergunta":"Para sua criação são necessários pelo menos 4 Discos;\nÉ um padrão relativamente novo, suportado por apenas algumas controladoras;\nGarantindo a integridade dos dados caso até 2 dos HDs falhem ao mesmo tempo. \n \nSão características do RAID: ","imagem":"","alternativas":"Escolha uma:\na. 01\nb. 10\nc. 100\nd. 6\ne. 5","resposta":"A resposta correta é: 6."},{"pergunta":"Similar ao RAID 0;\nUtiliza 3 ou + discos;\nNão é comercialmente viável;\nDivisão dos dados em bits;\nExige sincronia de discos;\nDirecionado para uso em discos que não possuem detecção de erro de fábrica.\n \nSão caraterísticas do RAID","imagem":"","alternativas":"Escolha uma:\na. 4\nb. 6\nc. 2\nd. 6\ne. 3","resposta":"A resposta correta é: 2."},{"pergunta":"Porque realizar teste de desempenho?","imagem":"","alternativas":"Escolha uma:\na.\nPara obter informações de quanto um determinado hardware, executado um sistema computacional, suporta. Este parâmetro é importante para decidir quais ferramentas usar ou quanto é preciso melhorar o software.\nb.\nPara obter informações de quanto um determinado hardware, executado um sistema computacional, suporta. Este parâmetro é importante para decidir quais ferramentas usar ou quanto é preciso melhorar o hardware.\nc.\nPara obter informações de quanto um determinado programa, executado em um sistema computacional, suporta. Este parâmetro é importante para decidir quais ferramentas usar ou quanto é preciso melhorar o software.\nd.\nPara obter informações de quanto um determinado software, executado um sistema computacional, suporta. Este parâmetro é importante para decidir quais ferramentas usar ou quanto é preciso melhorar o hardware.\ne.\nPara obter informações do fabricante de um determinado hardware, e suas compatibilidade. Este parâmetro é importante para decidir quais ferramentas usar ou quanto é preciso melhorar o software.","resposta":"A resposta correta é:\nPara obter informações de quanto um determinado hardware, executado um sistema computacional, suporta. Este parâmetro é importante para decidir quais ferramentas usar ou quanto é preciso melhorar o hardware.\n."},{"pergunta":"Sobre POST (Power-On Self Test), podemos afirmar:\n\n \n\nI. É uma série de testes realizados pelo BIOS;\n\nII. Ele determina os componentes de hardware instalados no sistema;\n\nIII. Ele consegue corrigir automaticamente pequenas erros, possivelmente de configuração;\n\nIV.  Depois de finalizado o POST é gerado um relatório com detalhes sobre o hardware do computador;\n\nV Em caso de anomalia de algum componente de hardware, o BIOS emite uma sequência de bips sonoros.\n\n \n\nEscolha a opção correta:","imagem":"","alternativas":"Escolha uma:\na. Todas as afirmações estão corretas\nb. A afirmação III é a unica incorreta\nc. As afirmações III e IV, estão incorretas\nd. A afirmação IV é a unica incorreta\ne. Todas as afirmações estão incorretas","resposta":"A resposta correta é: A afirmação III é a unica incorreta."},{"pergunta":"Todas as memórias atuais possuem o chip ____a____ , que armazena configurações indicadas pelo fabricante, tais como frequência do módulo e os tempos de acesso;\nAlguns fabricantes oferecem várias opções relacionadas à memória;\nPor padrão, as configurações são detectadas _____b____  , mas alterá-las manualmente pode melhorar o ____ c ____  .\n \nEscolha a opção que preenche corretamente as lacuna (a), (b) e (c):","imagem":"","alternativas":"Escolha uma:\na. a - RAM, b - automaticamente, c - desempenho\nb. a - Flash, b - diretamente, c - desempenho\nc. a - SRAM, b - automaticamente, c - desempenho\nd. a - ROM, b - automaticamente, c - desempenho\ne. a - ESPD, b - automaticamente, c - desempenho","resposta":"A resposta correta é: a - ESPD, b - automaticamente, c - desempenho."},{"pergunta":"Proporciona alto nível de tolerância a falhas, cada solicitação de I/O é espelhada em um segundo Disco Rígido;\nProporciona o mesmo throughput durante a escrita;\nOferece mais performance durante a leitura (read) – A controladora RAID executa o mesmo comando de leitura em cada Disco – assim que um dos discos disponibiliza os dados, ele é automaticamente transferido para o servidor e o próximo comando de leitura pode ser processado.\n \nEstamos nos referindo ao RAID:","imagem":"","alternativas":"Escolha uma:\na. 10\nb. 1\nc. 0\nd. 5\ne. 01","resposta":"A resposta correta é: 1."},{"pergunta":"Para implementar um arranjo deste RAID é necessário a criação de pelo menos dois subgrupos de HDs em RAID 1, que serão agregados. Como isso, o arranjo global permitirá que a gravação dos dados aconteça em todos os discos ao mesmo tempo, mantendo cada subgrupo com um disco para produção e outro de espelhamento.\n\nEste tipo de arranjo é característica do RAID:\n\n ","imagem":"","alternativas":"Escolha uma:\na. 11\nb. 10\nc. 100\nd. 50\ne. 01","resposta":"A resposta correta é: 10."},{"pergunta":"O primeiro passo é o  ___a____ (contagem de RAM, detecção de dispositivos – atribuindo IRQ, end. De I/O e outros recursos, carga do SO a partir da leitura da MBR;","imagem":"","alternativas":"Escolha uma:\na. POST\nb. SWAP\nc. RAM-ON\nd. POSIX\ne. BOOT","resposta":"A resposta correta é: POST."},{"pergunta":"Analise as afirmações abaixo:\n \nI - O projeto e pesquisa RAID foi desenvolvido pela Universidade de Berkley (CA-USA) nos anos 80.\nII - Tema Original = Redundant Array of Inexpensive Disks,  atualmente = Redundant Array ofIndependant Disks;\nIII - As controladoras atuais não permitem discos de valores diferentes nas matrizes;\nIV - O RAID combina um número independente de discos juntos proporcionando aumento do throughput/performance no acesso e confiabilidade dos dados;\nV - Níveis de RAID diferentes proporcionam uma variedade de misturas de performance e tolerância a falhas;\nVI - Os níveis de RAID 2 e 3, são pouco utilizados.\n \nEscolha a opção correta:","imagem":"","alternativas":"Escolha uma:\na. Todas as opções estão incorretas\nb. As opções II e VI, estão incorretas\nc. As opções III e VI, estão incorretas\nd. Todas as opções estão corretas\ne. As opções III e V, estão incorretas","resposta":"A resposta correta é: As opções III e VI, estão incorretas."},{"pergunta":"O que não pode ser considerado um teste de velocidade de escritas na RAM.","imagem":"","alternativas":"Escolha uma:\na. Teste de desempenho do cálculo de inteiros\nb. Teste de alocação de endereços\nc. Teste de Swap\nd. Teste de gravação\ne. Teste de leitura","resposta":"A resposta correta é: Teste de desempenho do cálculo de inteiros."},{"pergunta":"Analise as afirmações:\n \nI - As configurações do SETUP são cruciais para o funcionamento e bom desempenho do sistema, uma configuração errada pode tornar o sistema até 70% mais lento;\nII - O SETUP é um programa que permite configurar as opções do Hardware instalado, opções relacionadas ao desempenho do sistema, senhas entre outras;\nIII -  As configurações do SETUP são armazenadas em uma memória especial chamada CMOS;\nIV - A opção “SATA DMA Transfer” ativa o suporte a DMA para os CDs e DVDs ligados às portas SATA. \n \nEscolha a opção correta:\n ","imagem":"","alternativas":"Escolha uma:\na. A afirmação IV está incorreta e todas as outras estão corretas\nb. Todas as afirmações estão incorretas\nc. Todas as afirmações estão corretas\nd. A afirmação III está incorreta e todas as outras estão corretas\ne. A afirmação I está incorreta e todas as outras estão corretas","resposta":"A resposta correta é: A afirmação IV está incorreta e todas as outras estão corretas."},{"pergunta":"Utiliza 3 ou + discos;\nA Divisão dos dados é realizada em blocos;\nNecessita de sisco exclusivo de paridade;\nA Leitura é rápida, mas a escrita lenta;\nA Tecnologia não é mais usada.\n \nSão características do RAID:","imagem":"","alternativas":"Escolha uma:\na. 2\nb. 3\nc. 0\nd. 4\ne. 1","resposta":"A resposta correta é: 4."}]