[{"pergunta":"Um computador com um conjunto reduzido de instruções (RISC), tem como principais características:","imagem":"","alternativas":"Escolha uma:\na. Número maior de instruções e Menos Eficiência\nb. Número reduzido de instruções e Mais Eficiência\nc. Número reduzido de instruções e Menos Eficiência\nd. Número maior de instruções e Mais Eficiência","resposta":"A resposta correta é: Número reduzido de instruções e Mais Eficiência."},{"pergunta":"Das afirmações sobre Grid, qual está incorreta:","imagem":"","alternativas":"Escolha uma:\na. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.\nb. Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos a computação em grade.\nc. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.\nd. Embora a grade conecte várias plataformas diferentes, ela pode ser acessada a partir de um único navegador da web, por exemplo.","resposta":"A resposta correta é: No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.."},{"pergunta":"O que melhor define uma Grid Computing é:","imagem":"","alternativas":"Escolha uma:\na. Componentes de computação similares conectados usando uma rede local rápida.\nb. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em serie.\nc. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo.\nd. Grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como uma única unidade de computação.","resposta":"A resposta correta é: Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo.."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua interface e baixo custo, qual característica descrita abaixo não pertence a versão 3: ","imagem":"","alternativas":"Escolha uma:\na. 2 portas USB 2.0;\nb. 1GB LPDDR2 SDRAM\nc. Processador Broadcom BCM2837B0\nd. Slot cartão micro SD","resposta":"A resposta correta é: 2 portas USB 2.0;."},{"pergunta":"Sobre a criação de uma estrutura de Grid Computing, qual alternativa abaixo não é correta:","imagem":"","alternativas":"Escolha uma:\na. Milhares de computadores são empregados no processo. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede.\nb. Um software que é capaz de dividir o programa em muitos computadores é utilizado para essa finalidade.\nc. Todos os equipamentos estão conectados juntos usando a Internet.\nd. Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão.","resposta":"A resposta correta é: Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão.."},{"pergunta":"Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos:","imagem":"","alternativas":"Escolha uma:\na. o Windows.\nb. a clusterização.\nc. a computação em grade.\nd. o Linux.","resposta":"A resposta correta é: a computação em grade.."},{"pergunta":"Na computação em cluster, conectamos um grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como varias unidade de computação para resolver um problema comum de computação.","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso","resposta":"A resposta correta é 'Falso'."},{"pergunta":"A respeito de ARM (Advanced RISC Machine), qual afirmação abaixo não é verdadeira:","imagem":"","alternativas":"Escolha uma:\na. Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico.\nb. Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final.\nc. Utilizados em gadgets compactos (smartphones, tablets, roteadores e calculadoras).\nd. Possui recursos de hardware reduzido em relação aos computadores tradicionais.","resposta":"A resposta correta é: Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final.."},{"pergunta":"Alguns processadores antigos ainda são amplamente utilizados, como o Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) na construção de videogames, DVDs, Palms, injeção eletrônica, etc.","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Um AGC (Automatic Gain Control), pode ser considerado um sistema embarcado de pequena capacidade, ele foi utilizado inicialmente como um sistema de controle:","imagem":"","alternativas":"Escolha uma:\na. no Primeiro carro da Ford\nb. no Big-Ben\nc. na Estação espacial russa\nd. na Apollo","resposta":"A resposta correta é: na Apollo."},{"pergunta":"O primeiro Sistema Embarcado produzido em massa foi o:","imagem":"","alternativas":"Escolha uma:\na. Autoclick– Processador para controle de teclado da IBM\nb. Autonetics D-17 – Computador guia do míssil Minuteman\nc. Autonet– Computador guia de roteadores para Internet\nd. Autotronic – Computador guia de automóveis","resposta":"A resposta correta é: Autonetics D-17 – Computador guia do míssil Minuteman."},{"pergunta":"Em uma Grid Computing são empregados no processo milhares de sistemas computacionais. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede. Para realizar a função \"Grid\" todos estão conectados usando apenas uma rede local.","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso","resposta":"A resposta correta é 'Falso'."},{"pergunta":"O mercado de embarcados é aproximadamente 2 vezes maior que o de Desktops e deve diminuir exponencialmente na próxima década.","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso","resposta":"A resposta correta é 'Falso'."},{"pergunta":"A respeito das similaridade entre Grid e Cluster, é incorreto afirmar que:","imagem":"","alternativas":"Escolha uma:\na. Essas duas técnicas buscam aumentar a eficiência e o rendimento por meio de redes de computadores.\nb. Essas duas técnicas economizam dinheiro porque conseguem otimizar os recurso.\nc. Ambas as técnicas envolvem a solução de problemas de computação que não estão no escopo de um único computador, conectando computadores.\nd. Essas duas técnicas atendem a mesma abrangem geográfica.","resposta":"A resposta correta é: Essas duas técnicas atendem a mesma abrangem geográfica.."},{"pergunta":"Realize a associação com os itens relacionados abaixo:","imagem":"","alternativas":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial.\n\n\t\nResposta 1\nEscolher...\nvideo-games, DVDs, Palms, injeção eletrônica, etc.\nARM\nArquitetura Conceitual\nSistemas embarcados\n\n\n\nDesenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico\n\n\t\nResposta 2\nEscolher...\nvideo-games, DVDs, Palms, injeção eletrônica, etc.\nARM\nArquitetura Conceitual\nSistemas embarcados\n\n\n\nCamada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.)\n\n\t\nResposta 3\nEscolher...\nvideo-games, DVDs, Palms, injeção eletrônica, etc.\nARM\nArquitetura Conceitual\nSistemas embarcados\n\n\n\nZ80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits)\n\n\t\nResposta 4\nEscolher...\nvideo-games, DVDs, Palms, injeção eletrônica, etc.\nARM\nArquitetura Conceitual\nSistemas embarcados","resposta":"A resposta correta é: Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial. → Sistemas embarcados, Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico → ARM, Camada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.) → Arquitetura Conceitual, Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) → video-games, DVDs, Palms, injeção eletrônica, etc.."},{"pergunta":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem mais completos, fugindo ao conceito inicial de um sistema embarcado.","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Nos itens abaixo escolha o que não se relaciona a Camada de Hardware de uma arquitetura conceitual embarcada:","imagem":"","alternativas":"Escolha uma:\na. Memória RAM\nb. Processador Embarcado\nc. Memória ROM\nd. Interface IDE","resposta":"A resposta correta é: Interface IDE."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua simples interface e custo baixo, qual característica descrita abaixo não pertence a versão 3: ","imagem":"","alternativas":"Escolha uma:\na. Suporte a Power-over-Ethernet (PoE)\nb. Gigabit Ethernet over USB 2.0\nc. Conector de interface VGA\nd. 40-pin GPIO header","resposta":"A resposta correta é: Conector de interface VGA."},{"pergunta":" A respeito de Cluster, qual afirmação está incorreta:","imagem":"","alternativas":"Escolha uma:\na. Na tolerância a falhas, temos um sistema que é robusto o suficiente para lidar com falhas de hardware ou software. Mesmo se um nó falhar, a operação pode ser concluída por outros nós. O poder de computação do cluster é afetado quando um sistema está com falha, mas, no entanto, outros sistemas ainda estão disponíveis para executar a operação.\nb. No balanceamento de carga, distribuímos tarefas de computação pelo cluster, de modo que uma única máquina não seja sobrecarregada com um processamento pesado que não pode ser feito.\nc. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.\nd. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.","resposta":"A resposta correta é: Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.."},{"pergunta":"Devido aos constantes avanços na tecnologia e a queda nos custos de implementação tanto de componentes de software como hardware, a definição de Sistemas Embarcados está bem definida.","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso","resposta":"A resposta correta é 'Falso'."},{"pergunta":"O que melhor define uma Grid Computing é:\n\n","imagem":"","alternativas":"Escolha uma:\na. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em serie.\nb. Componentes de computação similares conectados usando uma rede local rápida.\nc. Grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como uma única unidade de computação.\nd. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo. \n","resposta":"A resposta correta é: Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo.."},{"pergunta":"Devido aos constantes avanços na tecnologia e a queda nos custos de implementação tanto de componentes de software como hardware, a definição de Sistemas Embarcados está bem definida.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"A respeito da OMAP (Open Multimedia Applications Platform), qual item abaixo não é verdadeiro:\n\n","imagem":"","alternativas":"Escolha uma:\na. Faz parte da Família de processadores com arquitetura dual core (ARM + DSP(Digital Signal Processing))\nb. Desenvolvida para baixo desempenho. \nc. Possui baixo consumo de energia.\nd. Desenvolvida para alto desempenho.\n","resposta":"A resposta correta é: Desenvolvida para baixo desempenho.."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua simples interface e custo baixo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. Gigabit Ethernet over USB 2.0\nb. Conector de interface VGA \nc. Suporte a Power-over-Ethernet (PoE)\nd. 40-pin GPIO header\n","resposta":"A resposta correta é: Conector de interface VGA."},{"pergunta":"A tendência para os sistemas embarcados é a adição de mais inteligência a processos e produtos, e maior conectividade, através de tecnologias de rede sem fio, por exemplo.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"A respeito das similaridade entre Grid e Cluster, é incorreto afirmar que:\n\n","imagem":"","alternativas":"Escolha uma:\na. Ambas as técnicas envolvem a solução de problemas de computação que não estão no escopo de um único computador, conectando computadores.\nb. Essas duas técnicas economizam dinheiro porque conseguem otimizar os recurso.\nc. Essas duas técnicas atendem a mesma abrangem geográfica. \nd. Essas duas técnicas buscam aumentar a eficiência e o rendimento por meio de redes de computadores.\n","resposta":"A resposta correta é: Essas duas técnicas atendem a mesma abrangem geográfica.."},{"pergunta":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem mais completos, fugindo ao conceito inicial de um sistema embarcado.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Um computador com um conjunto reduzido de instruções (RISC), tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Número reduzido de instruções e Mais Eficiência \nb. Número reduzido de instruções e Menos Eficiência\nc. Número maior de instruções e Menos Eficiência\nd. Número maior de instruções e Mais Eficiência\n","resposta":"A resposta correta é: Número reduzido de instruções e Mais Eficiência."},{"pergunta":" A respeito de Cluster, qual afirmação está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.\nb. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver. \nc. No balanceamento de carga, distribuímos tarefas de computação pelo cluster, de modo que uma única máquina não seja sobrecarregada com um processamento pesado que não pode ser feito.\nd. Na tolerância a falhas, temos um sistema que é robusto o suficiente para lidar com falhas de hardware ou software. Mesmo se um nó falhar, a operação pode ser concluída por outros nós. O poder de computação do cluster é afetado quando um sistema está com falha, mas, no entanto, outros sistemas ainda estão disponíveis para executar a operação.\n","resposta":"A resposta correta é: Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.."},{"pergunta":"Um computador com um conjunto complexo de instruções (CISC) tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Muitas operações e idênticos formatos e comprimentos de instruções\nb. Muitas operações e Diferentes formatos e comprimentos de programas\nc. Muitas operações e Diferentes formatos e comprimentos de instruções \nd. Poucas operações e Diferentes formatos e comprimentos de instruções\n","resposta":"A resposta correta é: Muitas operações e Diferentes formatos e comprimentos de instruções."},{"pergunta":"Na computação em cluster, conectamos um grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como varias unidade de computação para resolver um problema comum de computação.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Das afirmações sobre Grid, qual está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Embora a grade conecte várias plataformas diferentes, ela pode ser acessada a partir de um único navegador da web, por exemplo.\nb. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum. \nc. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.\nd. Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos a computação em grade.\n","resposta":"A resposta correta é: No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua interface e baixo custo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. 2 portas USB 2.0; \nb. Processador Broadcom BCM2837B0\nc. Slot cartão micro SD\nd. 1GB LPDDR2 SDRAM\n","resposta":"A resposta correta é: 2 portas USB 2.0;."},{"pergunta":"O primeiro Sistema Embarcado produzido em massa foi o:\n\n","imagem":"","alternativas":"Escolha uma:\na. Autonetics D-17 – Computador guia do míssil Minuteman \nb. Autotronic – Computador guia de automóveis\nc. Autoclick– Processador para controle de teclado da IBM\nd. Autonet– Computador guia de roteadores para Internet\n","resposta":"A resposta correta é: Autonetics D-17 – Computador guia do míssil Minuteman."},{"pergunta":"Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos:\n\n","imagem":"","alternativas":"Escolha uma:\na. o Windows.\nb. a clusterização.\nc. o Linux.\nd. a computação em grade. \n","resposta":"A resposta correta é: a computação em grade.."},{"pergunta":"Nos itens abaixo escolha o que não se relaciona a Camada de Hardware de uma arquitetura conceitual embarcada:\n\n","imagem":"","alternativas":"Escolha uma:\na. Memória ROM\nb. Processador Embarcado\nc. Interface IDE \nd. Memória RAM\n","resposta":"A resposta correta é: Interface IDE."},{"pergunta":"Sobre a criação de uma estrutura de Grid Computing, qual alternativa abaixo não é correta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão. \nb. Milhares de computadores são empregados no processo. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede.\nc. Todos os equipamentos estão conectados juntos usando a Internet.\nd. Um software que é capaz de dividir o programa em muitos computadores é utilizado para essa finalidade.\n","resposta":"A resposta correta é: Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão.."},{"pergunta":"Em uma Grid Computing são empregados no processo milhares de sistemas computacionais. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede. Para realizar a função \"Grid\" todos estão conectados usando apenas uma rede local.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Realize a associação com os itens relacionados abaixo:\n\n","imagem":"","alternativas":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial.\n\nResposta 1 \nDesenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico\n\nResposta 2 \nZ80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits)\n\nResposta 3 \nCamada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.)\n\nResposta 4 \n","resposta":"A resposta correta é: Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial. → Sistemas embarcados, Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico → ARM, Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) → video-games, DVDs, Palms, injeção eletrônica, etc., Camada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.) → Arquitetura Conceitual."},{"pergunta":"O mercado de embarcados é aproximadamente 2 vezes maior que o de Desktops e deve diminuir exponencialmente na próxima década.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Um computador com um conjunto reduzido de instruções (RISC), tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Número maior de instruções e Mais Eficiência\nb. Número maior de instruções e Menos Eficiência\nc. Número reduzido de instruções e Menos Eficiência\nd. Número reduzido de instruções e Mais Eficiência \n","resposta":"A resposta correta é: Número reduzido de instruções e Mais Eficiência."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua simples interface e custo baixo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. Suporte a Power-over-Ethernet (PoE)\nb. 40-pin GPIO header\nc. Gigabit Ethernet over USB 2.0\nd. Conector de interface VGA \n","resposta":"A resposta correta é: Conector de interface VGA."},{"pergunta":"Sobre a criação de uma estrutura de Grid Computing, qual alternativa abaixo não é correta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Um software que é capaz de dividir o programa em muitos computadores é utilizado para essa finalidade.\nb. Todos os equipamentos estão conectados juntos usando a Internet.\nc. Milhares de computadores são empregados no processo. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede.\nd. Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão. \n","resposta":"A resposta correta é: Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão.."},{"pergunta":"Nos itens abaixo escolha o que não se relaciona a Camada de Hardware de uma arquitetura conceitual embarcada:\n\n","imagem":"","alternativas":"Escolha uma:\na. Memória ROM\nb. Memória RAM\nc. Interface IDE \nd. Processador Embarcado\n","resposta":"A resposta correta é: Interface IDE."},{"pergunta":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem mais completos, fugindo ao conceito inicial de um sistema embarcado.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos:\n\n","imagem":"","alternativas":"Escolha uma:\na. a clusterização. \nb. o Windows.\nc. o Linux.\nd. a computação em grade.\n","resposta":"A resposta correta é: a computação em grade.."},{"pergunta":"Um AGC (Automatic Gain Control), pode ser considerado um sistema embarcado de pequena capacidade, ele foi utilizado inicialmente como um sistema de controle:\n\n","imagem":"","alternativas":"Escolha uma:\na. na Estação espacial russa\nb. no Primeiro carro da Ford\nc. na Apollo \nd. no Big-Ben\n","resposta":"A resposta correta é: na Apollo."},{"pergunta":"Das afirmações sobre Grid, qual está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum. \nb. Embora a grade conecte várias plataformas diferentes, ela pode ser acessada a partir de um único navegador da web, por exemplo.\nc. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.\nd. Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos a computação em grade.\n","resposta":"A resposta correta é: No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.."},{"pergunta":"Alguns processadores antigos ainda são amplamente utilizados, como o Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) na construção de videogames, DVDs, Palms, injeção eletrônica, etc.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"O que melhor define uma Grid Computing é:\n\n","imagem":"","alternativas":"Escolha uma:\na. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em serie.\nb. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo. \nc. Componentes de computação similares conectados usando uma rede local rápida.\nd. Grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como uma única unidade de computação.\n","resposta":"A resposta correta é: Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo.."},{"pergunta":"O primeiro Sistema Embarcado produzido em massa foi o:\n\n","imagem":"","alternativas":"Escolha uma:\na. Autoclick– Processador para controle de teclado da IBM\nb. Autotronic – Computador guia de automóveis\nc. Autonet– Computador guia de roteadores para Internet\nd. Autonetics D-17 – Computador guia do míssil Minuteman \n","resposta":"A resposta correta é: Autonetics D-17 – Computador guia do míssil Minuteman."},{"pergunta":"O mercado de embarcados é aproximadamente 2 vezes maior que o de Desktops e deve diminuir exponencialmente na próxima década.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Devido aos constantes avanços na tecnologia e a queda nos custos de implementação tanto de componentes de software como hardware, a definição de Sistemas Embarcados está bem definida.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"A respeito da OMAP (Open Multimedia Applications Platform), qual item abaixo não é verdadeiro:\n\n","imagem":"","alternativas":"Escolha uma:\na. Desenvolvida para baixo desempenho. \nb. Possui baixo consumo de energia.\nc. Desenvolvida para alto desempenho.\nd. Faz parte da Família de processadores com arquitetura dual core (ARM + DSP(Digital Signal Processing))\n","resposta":"A resposta correta é: Desenvolvida para baixo desempenho.."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua interface e baixo custo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. 1GB LPDDR2 SDRAM\nb. 2 portas USB 2.0; \nc. Processador Broadcom BCM2837B0\nd. Slot cartão micro SD\n","resposta":"A resposta correta é: 2 portas USB 2.0;."},{"pergunta":"Na computação em cluster, conectamos um grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como varias unidade de computação para resolver um problema comum de computação.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Em uma Grid Computing são empregados no processo milhares de sistemas computacionais. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede. Para realizar a função \"Grid\" todos estão conectados usando apenas uma rede local.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Realize a associação com os itens relacionados abaixo:\n\n","imagem":"","alternativas":"Camada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.)\n\nResposta 1 \nZ80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits)\n\nResposta 2 \nAlguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial.\n\nResposta 3 \nDesenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico\n\nResposta 4 \n","resposta":"A resposta correta é: Camada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.) → Arquitetura Conceitual, Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) → video-games, DVDs, Palms, injeção eletrônica, etc., Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial. → Sistemas embarcados, Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico → ARM."},{"pergunta":" A respeito de Cluster, qual afirmação está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. No balanceamento de carga, distribuímos tarefas de computação pelo cluster, de modo que uma única máquina não seja sobrecarregada com um processamento pesado que não pode ser feito.\nb. Na tolerância a falhas, temos um sistema que é robusto o suficiente para lidar com falhas de hardware ou software. Mesmo se um nó falhar, a operação pode ser concluída por outros nós. O poder de computação do cluster é afetado quando um sistema está com falha, mas, no entanto, outros sistemas ainda estão disponíveis para executar a operação.\nc. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver. \nd. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.\n","resposta":"A resposta correta é: Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.."},{"pergunta":"Um computador com um conjunto complexo de instruções (CISC) tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Poucas operações e Diferentes formatos e comprimentos de instruções\nb. Muitas operações e idênticos formatos e comprimentos de instruções\nc. Muitas operações e Diferentes formatos e comprimentos de programas\nd. Muitas operações e Diferentes formatos e comprimentos de instruções \n","resposta":"A resposta correta é: Muitas operações e Diferentes formatos e comprimentos de instruções."},{"pergunta":"Alguns processadores antigos ainda são amplamente utilizados, como o Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) na construção de videogames, DVDs, Palms, injeção eletrônica, etc.\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"O mercado de embarcados é aproximadamente 2 vezes maior que o de Desktops e deve diminuir exponencialmente na próxima década.\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Das afirmações sobre Grid, qual está incorreta:\n","imagem":"","alternativas":"Escolha uma:\na. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver. \nb. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.\nc. Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos a computação em grade.\nd. Embora a grade conecte várias plataformas diferentes, ela pode ser acessada a partir de um único navegador da web, por exemplo.\n","resposta":"A resposta correta é: No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.."},{"pergunta":"Um computador com um conjunto reduzido de instruções (RISC), tem como principais características:\n","imagem":"","alternativas":"Escolha uma:\na. Número maior de instruções e Menos Eficiência\nb. Número reduzido de instruções e Mais Eficiência \nc. Número reduzido de instruções e Menos Eficiência\nd. Número maior de instruções e Mais Eficiência\n","resposta":"A resposta correta é: Número reduzido de instruções e Mais Eficiência."},{"pergunta":"Realize a associação com os itens relacionados abaixo:\n","imagem":"","alternativas":"Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico\n\nResposta 1 \nZ80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits)\n\nResposta 2 \nCamada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.)\n\nResposta 3 \nAlguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial.\n\nResposta 4 \n","resposta":"A resposta correta é: Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico → ARM, Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) → video-games, DVDs, Palms, injeção eletrônica, etc., Camada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.) → Arquitetura Conceitual, Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial. → Sistemas embarcados."},{"pergunta":"Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos:\n","imagem":"","alternativas":"Escolha uma:\na. o Windows.\nb. o Linux.\nc. a computação em grade. \nd. a clusterização.\n","resposta":"A resposta correta é: a computação em grade.."},{"pergunta":"A respeito de ARM (Advanced RISC Machine), qual afirmação abaixo não é verdadeira:\n","imagem":"","alternativas":"Escolha uma:\na. Possui recursos de hardware reduzido em relação aos computadores tradicionais.\nb. Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico.\nc. Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final.\nd. Utilizados em gadgets compactos (smartphones, tablets, roteadores e calculadoras).\n","resposta":"A resposta correta é: Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final.."},{"pergunta":"Sobre a criação de uma estrutura de Grid Computing, qual alternativa abaixo não é correta:\n","imagem":"","alternativas":"Escolha uma:\na. Um software que é capaz de dividir o programa em muitos computadores é utilizado para essa finalidade.\nb. Todos os equipamentos estão conectados juntos usando a Internet.\nc. Milhares de computadores são empregados no processo. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede.\nd. Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão. \n","resposta":"A resposta correta é: Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão.."},{"pergunta":"Nos itens abaixo escolha o que não se relaciona a Camada de Hardware de uma arquitetura conceitual embarcada:\n","imagem":"","alternativas":"Escolha uma:\na. Interface IDE \nb. Memória RAM\nc. Memória ROM\nd. Processador Embarcado\n","resposta":"A resposta correta é: Interface IDE."},{"pergunta":" A respeito de Cluster, qual afirmação está incorreta:\n","imagem":"","alternativas":"Escolha uma:\na. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.\nb. Na tolerância a falhas, temos um sistema que é robusto o suficiente para lidar com falhas de hardware ou software. Mesmo se um nó falhar, a operação pode ser concluída por outros nós. O poder de computação do cluster é afetado quando um sistema está com falha, mas, no entanto, outros sistemas ainda estão disponíveis para executar a operação.\nc. No balanceamento de carga, distribuímos tarefas de computação pelo cluster, de modo que uma única máquina não seja sobrecarregada com um processamento pesado que não pode ser feito.\nd. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver. \n","resposta":"A resposta correta é: Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua interface e baixo custo, qual característica descrita abaixo não pertence a versão 3: \n","imagem":"","alternativas":"Escolha uma:\na. Processador Broadcom BCM2837B0\nb. 2 portas USB 2.0; \nc. Slot cartão micro SD\nd. 1GB LPDDR2 SDRAM\n","resposta":"A resposta correta é: 2 portas USB 2.0;."},{"pergunta":"O primeiro Sistema Embarcado produzido em massa foi o:\n","imagem":"","alternativas":"Escolha uma:\na. Autonetics D-17 – Computador guia do míssil Minuteman \nb. Autonet– Computador guia de roteadores para Internet\nc. Autotronic – Computador guia de automóveis\nd. Autoclick– Processador para controle de teclado da IBM\n","resposta":"A resposta correta é: Autonetics D-17 – Computador guia do míssil Minuteman."},{"pergunta":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem mais completos, fugindo ao conceito inicial de um sistema embarcado.\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"A respeito da OMAP (Open Multimedia Applications Platform), qual item abaixo não é verdadeiro:\n","imagem":"","alternativas":"Escolha uma:\na. Desenvolvida para alto desempenho.\nb. Possui baixo consumo de energia.\nc. Faz parte da Família de processadores com arquitetura dual core (ARM + DSP(Digital Signal Processing))\nd. Desenvolvida para baixo desempenho. \n","resposta":"A resposta correta é: Desenvolvida para baixo desempenho.."},{"pergunta":"Na computação em cluster, conectamos um grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como varias unidade de computação para resolver um problema comum de computação.\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"O que melhor define uma Grid Computing é:\n","imagem":"","alternativas":"Escolha uma:\na. Grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como uma única unidade de computação.\nb. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo. \nc. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em serie.\nd. Componentes de computação similares conectados usando uma rede local rápida.\n","resposta":"A resposta correta é: Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo.."},{"pergunta":"Um AGC (Automatic Gain Control), pode ser considerado um sistema embarcado de pequena capacidade, ele foi utilizado inicialmente como um sistema de controle:\n","imagem":"","alternativas":"Escolha uma:\na. na Apollo \nb. na Estação espacial russa\nc. no Primeiro carro da Ford\nd. no Big-Ben\n","resposta":"A resposta correta é: na Apollo."},{"pergunta":"Devido aos constantes avanços na tecnologia e a queda nos custos de implementação tanto de componentes de software como hardware, a definição de Sistemas Embarcados está bem definida.\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua simples interface e custo baixo, qual característica descrita abaixo não pertence a versão 3: \n","imagem":"","alternativas":"Escolha uma:\na. Conector de interface VGA \nb. Gigabit Ethernet over USB 2.0\nc. 40-pin GPIO header\nd. Suporte a Power-over-Ethernet (PoE)\n","resposta":"A resposta correta é: Conector de interface VGA."},{"pergunta":"A respeito das similaridade entre Grid e Cluster, é incorreto afirmar que:\n","imagem":"","alternativas":"Escolha uma:\na. Essas duas técnicas atendem a mesma abrangem geográfica. \nb. Ambas as técnicas envolvem a solução de problemas de computação que não estão no escopo de um único computador, conectando computadores.\nc. Essas duas técnicas buscam aumentar a eficiência e o rendimento por meio de redes de computadores.\nd. Essas duas técnicas economizam dinheiro porque conseguem otimizar os recurso.\n","resposta":"A resposta correta é: Essas duas técnicas atendem a mesma abrangem geográfica.."},{"pergunta":"Em uma Grid Computing são empregados no processo milhares de sistemas computacionais. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede. Para realizar a função \"Grid\" todos estão conectados usando apenas uma rede local.\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Um computador com um conjunto complexo de instruções (CISC) tem como principais características:\n","imagem":"","alternativas":"Escolha uma:\na. Muitas operações e Diferentes formatos e comprimentos de instruções \nb. Muitas operações e Diferentes formatos e comprimentos de programas\nc. Poucas operações e Diferentes formatos e comprimentos de instruções\nd. Muitas operações e idênticos formatos e comprimentos de instruções\n","resposta":"A resposta correta é: Muitas operações e Diferentes formatos e comprimentos de instruções."},{"pergunta":"A tendência para os sistemas embarcados é a adição de mais inteligência a processos e produtos, e maior conectividade, através de tecnologias de rede sem fio, por exemplo.\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"A respeito de ARM (Advanced RISC Machine), qual afirmação abaixo não é verdadeira:\n","imagem":"","alternativas":"Escolha uma:\na. Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final.\nb. Possui recursos de hardware reduzido em relação aos computadores tradicionais.\nc. Utilizados em gadgets compactos (smartphones, tablets, roteadores e calculadoras).\nd. Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico.\n","resposta":"A resposta correta é: Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final.."},{"pergunta":"Um AGC (Automatic Gain Control), pode ser considerado um sistema embarcado de pequena capacidade, ele foi utilizado inicialmente como um sistema de controle:\n","imagem":"","alternativas":"Escolha uma:\na. na Apollo \nb. no Big-Ben\nc. na Estação espacial russa\nd. no Primeiro carro da Ford\n","resposta":"A resposta correta é: na Apollo."},{"pergunta":"O primeiro Sistema Embarcado produzido em massa foi o:\n","imagem":"","alternativas":"Escolha uma:\na. Autonet– Computador guia de roteadores para Internet\nb. Autoclick– Processador para controle de teclado da IBM\nc. Autonetics D-17 – Computador guia do míssil Minuteman \nd. Autotronic – Computador guia de automóveis\n","resposta":"A resposta correta é: Autonetics D-17 – Computador guia do míssil Minuteman."},{"pergunta":"Devido aos constantes avanços na tecnologia e a queda nos custos de implementação tanto de componentes de software como hardware, a definição de Sistemas Embarcados está bem definida.\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"O que melhor define uma Grid Computing é:\n","imagem":"","alternativas":"Escolha uma:\na. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em serie.\nb. Grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como uma única unidade de computação.\nc. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo. \nd. Componentes de computação similares conectados usando uma rede local rápida.\n","resposta":"A resposta correta é: Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo.."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua interface e baixo custo, qual característica descrita abaixo não pertence a versão 3: \n","imagem":"","alternativas":"Escolha uma:\na. 2 portas USB 2.0; \nb. Processador Broadcom BCM2837B0\nc. Slot cartão micro SD\nd. 1GB LPDDR2 SDRAM\n","resposta":"A resposta correta é: 2 portas USB 2.0;."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua simples interface e custo baixo, qual característica descrita abaixo não pertence a versão 3: \n","imagem":"","alternativas":"Escolha uma:\na. Conector de interface VGA \nb. Gigabit Ethernet over USB 2.0\nc. 40-pin GPIO header\nd. Suporte a Power-over-Ethernet (PoE)\n","resposta":"A resposta correta é: Conector de interface VGA."},{"pergunta":"Um computador com um conjunto reduzido de instruções (RISC), tem como principais características:\n","imagem":"","alternativas":"Escolha uma:\na. Número reduzido de instruções e Mais Eficiência \nb. Número maior de instruções e Menos Eficiência\nc. Número reduzido de instruções e Menos Eficiência\nd. Número maior de instruções e Mais Eficiência\n","resposta":"A resposta correta é: Número reduzido de instruções e Mais Eficiência."},{"pergunta":"A respeito das similaridade entre Grid e Cluster, é incorreto afirmar que:\n","imagem":"","alternativas":"Escolha uma:\na. Essas duas técnicas atendem a mesma abrangem geográfica. \nb. Ambas as técnicas envolvem a solução de problemas de computação que não estão no escopo de um único computador, conectando computadores.\nc. Essas duas técnicas buscam aumentar a eficiência e o rendimento por meio de redes de computadores.\nd. Essas duas técnicas economizam dinheiro porque conseguem otimizar os recurso.\n","resposta":"A resposta correta é: Essas duas técnicas atendem a mesma abrangem geográfica.."},{"pergunta":"Realize a associação com os itens relacionados abaixo:\n","imagem":"","alternativas":"Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits)\n\nResposta 1 \nDesenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico\n\nResposta 2 \nCamada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.)\n\nResposta 3 \nAlguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial.\n\nResposta 4 \n","resposta":"A resposta correta é: Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) → video-games, DVDs, Palms, injeção eletrônica, etc., Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico → ARM, Camada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.) → Arquitetura Conceitual, Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial. → Sistemas embarcados."},{"pergunta":"Sobre a criação de uma estrutura de Grid Computing, qual alternativa abaixo não é correta:\n","imagem":"","alternativas":"Escolha uma:\na. Milhares de computadores são empregados no processo. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede.\nb. Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão. \nc. Um software que é capaz de dividir o programa em muitos computadores é utilizado para essa finalidade.\nd. Todos os equipamentos estão conectados juntos usando a Internet.\n","resposta":"A resposta correta é: Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão.."},{"pergunta":"A respeito da OMAP (Open Multimedia Applications Platform), qual item abaixo não é verdadeiro:\n","imagem":"","alternativas":"Escolha uma:\na. Faz parte da Família de processadores com arquitetura dual core (ARM + DSP(Digital Signal Processing))\nb. Possui baixo consumo de energia.\nc. Desenvolvida para alto desempenho.\nd. Desenvolvida para baixo desempenho. \n","resposta":"A resposta correta é: Desenvolvida para baixo desempenho.."},{"pergunta":"Alguns processadores antigos ainda são amplamente utilizados, como o Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) na construção de videogames, DVDs, Palms, injeção eletrônica, etc.\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem mais completos, fugindo ao conceito inicial de um sistema embarcado.\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Das afirmações sobre Grid, qual está incorreta:\n","imagem":"","alternativas":"Escolha uma:\na. Embora a grade conecte várias plataformas diferentes, ela pode ser acessada a partir de um único navegador da web, por exemplo.\nb. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.\nc. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum. \nd. Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos a computação em grade.\n","resposta":"A resposta correta é: No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.."},{"pergunta":"Na computação em cluster, conectamos um grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como varias unidade de computação para resolver um problema comum de computação.\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"O mercado de embarcados é aproximadamente 2 vezes maior que o de Desktops e deve diminuir exponencialmente na próxima década.\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem mais completos, fugindo ao conceito inicial de um sistema embarcado.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"A respeito de ARM (Advanced RISC Machine), qual afirmação abaixo não é verdadeira:\n\n","imagem":"","alternativas":"Escolha uma:\na. Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final. \nb. Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico.\nc. Utilizados em gadgets compactos (smartphones, tablets, roteadores e calculadoras).\nd. Possui recursos de hardware reduzido em relação aos computadores tradicionais.\n","resposta":"A resposta correta é: Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final.."},{"pergunta":" A respeito de Cluster, qual afirmação está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver. \nb. Na tolerância a falhas, temos um sistema que é robusto o suficiente para lidar com falhas de hardware ou software. Mesmo se um nó falhar, a operação pode ser concluída por outros nós. O poder de computação do cluster é afetado quando um sistema está com falha, mas, no entanto, outros sistemas ainda estão disponíveis para executar a operação.\nc. No balanceamento de carga, distribuímos tarefas de computação pelo cluster, de modo que uma única máquina não seja sobrecarregada com um processamento pesado que não pode ser feito.\nd. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.\n","resposta":"A resposta correta é: Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.."},{"pergunta":"Na computação em cluster, conectamos um grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como varias unidade de computação para resolver um problema comum de computação.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Das afirmações sobre Grid, qual está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum. \nb. Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos a computação em grade.\nc. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.\nd. Embora a grade conecte várias plataformas diferentes, ela pode ser acessada a partir de um único navegador da web, por exemplo.\n","resposta":"A resposta correta é: No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.."},{"pergunta":"Realize a associação com os itens relacionados abaixo:\n\n","imagem":"","alternativas":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial.\n\nResposta 1 \nCamada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.)\n\nResposta 2 \nDesenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico\n\nResposta 3 \nZ80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits)\n\nResposta 4 \n","resposta":"Você selecionou corretamente 1."},{"pergunta":"O que melhor define uma Grid Computing é:\n\n","imagem":"","alternativas":"Escolha uma:\na. Componentes de computação similares conectados usando uma rede local rápida.\nb. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo. \nc. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em serie.\nd. Grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como uma única unidade de computação.\n","resposta":"A resposta correta é: Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo.."},{"pergunta":"O primeiro Sistema Embarcado produzido em massa foi o:\n\n","imagem":"","alternativas":"Escolha uma:\na. Autonet Computador guia de roteadores para Internet\nb. Autonetics D-17  Computador guia do míssil Minuteman \nc. Autoclick Processador para controle de teclado da IBM\nd. Autotronic  Computador guia de automóveis\n","resposta":"A resposta correta é: Autonetics D-17  Computador guia do míssil Minuteman."},{"pergunta":"A respeito das similaridade entre Grid e Cluster, é incorreto afirmar que:\n\n","imagem":"","alternativas":"Escolha uma:\na. Essas duas técnicas buscam aumentar a eficiência e o rendimento por meio de redes de computadores.\nb. Essas duas técnicas atendem a mesma abrangem geográfica. \nc. Essas duas técnicas economizam dinheiro porque conseguem otimizar os recurso.\nd. Ambas as técnicas envolvem a solução de problemas de computação que não estão no escopo de um único computador, conectando computadores.\n","resposta":"A resposta correta é: Essas duas técnicas atendem a mesma abrangem geográfica.."},{"pergunta":"Um computador com um conjunto complexo de instruções (CISC) tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Muitas operações e Diferentes formatos e comprimentos de instruções \nb. Muitas operações e Diferentes formatos e comprimentos de programas\nc. Muitas operações e idênticos formatos e comprimentos de instruções\nd. Poucas operações e Diferentes formatos e comprimentos de instruções\n","resposta":"A resposta correta é: Muitas operações e Diferentes formatos e comprimentos de instruções."},{"pergunta":"Devido aos constantes avanços na tecnologia e a queda nos custos de implementação tanto de componentes de software como hardware, a definição de Sistemas Embarcados está bem definida.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"A respeito da OMAP (Open Multimedia Applications Platform), qual item abaixo não é verdadeiro:\n\n","imagem":"","alternativas":"Escolha uma:\na. Possui baixo consumo de energia.\nb. Desenvolvida para alto desempenho.\nc. Desenvolvida para baixo desempenho. \nd. Faz parte da Família de processadores com arquitetura dual core (ARM + DSP(Digital Signal Processing))\n","resposta":"A resposta correta é: Desenvolvida para baixo desempenho.."},{"pergunta":"A tendência para os sistemas embarcados é a adição de mais inteligência a processos e produtos, e maior conectividade, através de tecnologias de rede sem fio, por exemplo.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Nos itens abaixo escolha o que não se relaciona a Camada de Hardware de uma arquitetura conceitual embarcada:\n\n","imagem":"","alternativas":"Escolha uma:\na. Interface IDE \nb. Memória RAM\nc. Processador Embarcado\nd. Memória ROM\n","resposta":"A resposta correta é: Interface IDE."},{"pergunta":"O mercado de embarcados é aproximadamente 2 vezes maior que o de Desktops e deve diminuir exponencialmente na próxima década.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Um computador com um conjunto reduzido de instruções (RISC), tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Número reduzido de instruções e Mais Eficiência \nb. Número reduzido de instruções e Menos Eficiência\nc. Número maior de instruções e Mais Eficiência\nd. Número maior de instruções e Menos Eficiência\n","resposta":"A resposta correta é: Número reduzido de instruções e Mais Eficiência."},{"pergunta":"Um AGC (Automatic Gain Control), pode ser considerado um sistema embarcado de pequena capacidade, ele foi utilizado inicialmente como um sistema de controle:\n\n","imagem":"","alternativas":"Escolha uma:\na. no Big-Ben\nb. na Estação espacial russa\nc. na Apollo \nd. no Primeiro carro da Ford\n","resposta":"A resposta correta é: na Apollo."},{"pergunta":"Sobre a criação de uma estrutura de Grid Computing, qual alternativa abaixo não é correta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Milhares de computadores são empregados no processo. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede.\nb. Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão. \nc. Um software que é capaz de dividir o programa em muitos computadores é utilizado para essa finalidade.\nd. Todos os equipamentos estão conectados juntos usando a Internet.\n","resposta":"A resposta correta é: Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão.."},{"pergunta":"Alguns processadores antigos ainda são amplamente utilizados, como o Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) na construção de videogames, DVDs, Palms, injeção eletrônica, etc.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua interface e baixo custo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. 2 portas USB 2.0; \nb. 1GB LPDDR2 SDRAM\nc. Slot cartão micro SD\nd. Processador Broadcom BCM2837B0\n","resposta":"A resposta correta é: 2 portas USB 2.0;."},{"pergunta":"O mercado de embarcados é aproximadamente 2 vezes maior que o de Desktops e deve diminuir exponencialmente na próxima década.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"A respeito de ARM (Advanced RISC Machine), qual afirmação abaixo não é verdadeira:\n\n","imagem":"","alternativas":"Escolha uma:\na. Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final. \nb. Possui recursos de hardware reduzido em relação aos computadores tradicionais.\nc. Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico.\nd. Utilizados em gadgets compactos (smartphones, tablets, roteadores e calculadoras).\n","resposta":"A resposta correta é: Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final.."},{"pergunta":"Um computador com um conjunto complexo de instruções (CISC) tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Poucas operações e Diferentes formatos e comprimentos de instruções\nb. Muitas operações e idênticos formatos e comprimentos de instruções\nc. Muitas operações e Diferentes formatos e comprimentos de programas\nd. Muitas operações e Diferentes formatos e comprimentos de instruções \n","resposta":"A resposta correta é: Muitas operações e Diferentes formatos e comprimentos de instruções."},{"pergunta":"A respeito da OMAP (Open Multimedia Applications Platform), qual item abaixo não é verdadeiro:\n\n","imagem":"","alternativas":"Escolha uma:\na. Possui baixo consumo de energia.\nb. Faz parte da Família de processadores com arquitetura dual core (ARM + DSP(Digital Signal Processing))\nc. Desenvolvida para alto desempenho.\nd. Desenvolvida para baixo desempenho. \n","resposta":"A resposta correta é: Desenvolvida para baixo desempenho.."},{"pergunta":"O que melhor define uma Grid Computing é:\n\n","imagem":"","alternativas":"Escolha uma:\na. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo. \nb. Grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como uma única unidade de computação.\nc. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em serie.\nd. Componentes de computação similares conectados usando uma rede local rápida.\n","resposta":"A resposta correta é: Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo.."},{"pergunta":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem mais completos, fugindo ao conceito inicial de um sistema embarcado.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua simples interface e custo baixo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. Suporte a Power-over-Ethernet (PoE)\nb. Gigabit Ethernet over USB 2.0\nc. Conector de interface VGA \nd. 40-pin GPIO header\n","resposta":"A resposta correta é: Conector de interface VGA."},{"pergunta":"Devido aos constantes avanços na tecnologia e a queda nos custos de implementação tanto de componentes de software como hardware, a definição de Sistemas Embarcados está bem definida.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"A respeito das similaridade entre Grid e Cluster, é incorreto afirmar que:\n\n","imagem":"","alternativas":"Escolha uma:\na. Essas duas técnicas economizam dinheiro porque conseguem otimizar os recurso.\nb. Essas duas técnicas atendem a mesma abrangem geográfica. \nc. Ambas as técnicas envolvem a solução de problemas de computação que não estão no escopo de um único computador, conectando computadores.\nd. Essas duas técnicas buscam aumentar a eficiência e o rendimento por meio de redes de computadores.\n","resposta":"A resposta correta é: Essas duas técnicas atendem a mesma abrangem geográfica.."},{"pergunta":"Realize a associação com os itens relacionados abaixo:\n\n","imagem":"","alternativas":"Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico\n\nResposta 1 \nZ80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits)\n\nResposta 2 \nCamada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.)\n\nResposta 3 \nAlguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial.\n\nResposta 4 \n","resposta":"A resposta correta é: Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico → ARM, Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) → video-games, DVDs, Palms, injeção eletrônica, etc., Camada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.) → Arquitetura Conceitual, Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial. → Sistemas embarcados."},{"pergunta":"Nos itens abaixo escolha o que não se relaciona a Camada de Hardware de uma arquitetura conceitual embarcada:\n\n","imagem":"","alternativas":"Escolha uma:\na. Processador Embarcado\nb. Memória RAM\nc. Memória ROM\nd. Interface IDE \n","resposta":"A resposta correta é: Interface IDE."},{"pergunta":"Um computador com um conjunto reduzido de instruções (RISC), tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Número reduzido de instruções e Mais Eficiência \nb. Número reduzido de instruções e Menos Eficiência\nc. Número maior de instruções e Menos Eficiência\nd. Número maior de instruções e Mais Eficiência\n","resposta":"A resposta correta é: Número reduzido de instruções e Mais Eficiência."},{"pergunta":"Na computação em cluster, conectamos um grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como varias unidade de computação para resolver um problema comum de computação.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Alguns processadores antigos ainda são amplamente utilizados, como o Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) na construção de videogames, DVDs, Palms, injeção eletrônica, etc.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":" A respeito de Cluster, qual afirmação está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. No balanceamento de carga, distribuímos tarefas de computação pelo cluster, de modo que uma única máquina não seja sobrecarregada com um processamento pesado que não pode ser feito.\nb. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.\nc. Na tolerância a falhas, temos um sistema que é robusto o suficiente para lidar com falhas de hardware ou software. Mesmo se um nó falhar, a operação pode ser concluída por outros nós. O poder de computação do cluster é afetado quando um sistema está com falha, mas, no entanto, outros sistemas ainda estão disponíveis para executar a operação.\nd. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver. \n","resposta":"A resposta correta é: Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.."},{"pergunta":"A tendência para os sistemas embarcados é a adição de mais inteligência a processos e produtos, e maior conectividade, através de tecnologias de rede sem fio, por exemplo.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Sobre a criação de uma estrutura de Grid Computing, qual alternativa abaixo não é correta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão. \nb. Milhares de computadores são empregados no processo. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede.\nc. Um software que é capaz de dividir o programa em muitos computadores é utilizado para essa finalidade.\nd. Todos os equipamentos estão conectados juntos usando a Internet.\n","resposta":"A resposta correta é: Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão.."},{"pergunta":"Em uma Grid Computing são empregados no processo milhares de sistemas computacionais. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede. Para realizar a função \"Grid\" todos estão conectados usando apenas uma rede local.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Das afirmações sobre Grid, qual está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.\nb. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum. \nc. Embora a grade conecte várias plataformas diferentes, ela pode ser acessada a partir de um único navegador da web, por exemplo.\nd. Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos a computação em grade.\n","resposta":"A resposta correta é: No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua interface e baixo custo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. 2 portas USB 2.0; \nb. Processador Broadcom BCM2837B0\nc. Slot cartão micro SD\nd. 1GB LPDDR2 SDRAM\n","resposta":"A resposta correta é: 2 portas USB 2.0;."},{"pergunta":"Sobre a criação de uma estrutura de Grid Computing, qual alternativa abaixo não é correta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Todos os equipamentos estão conectados juntos usando a Internet.\nb. Um software que é capaz de dividir o programa em muitos computadores é utilizado para essa finalidade.\nc. Milhares de computadores são empregados no processo. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede.\nd. Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão. \n","resposta":"A resposta correta é: Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão.."},{"pergunta":" A respeito de Cluster, qual afirmação está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. No balanceamento de carga, distribuímos tarefas de computação pelo cluster, de modo que uma única máquina não seja sobrecarregada com um processamento pesado que não pode ser feito.\nb. Na tolerância a falhas, temos um sistema que é robusto o suficiente para lidar com falhas de hardware ou software. Mesmo se um nó falhar, a operação pode ser concluída por outros nós. O poder de computação do cluster é afetado quando um sistema está com falha, mas, no entanto, outros sistemas ainda estão disponíveis para executar a operação.\nc. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver. \nd. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.\n","resposta":"A resposta correta é: Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.."},{"pergunta":"Devido aos constantes avanços na tecnologia e a queda nos custos de implementação tanto de componentes de software como hardware, a definição de Sistemas Embarcados está bem definida.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"A tendência para os sistemas embarcados é a adição de mais inteligência a processos e produtos, e maior conectividade, através de tecnologias de rede sem fio, por exemplo.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Das afirmações sobre Grid, qual está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.\nb. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.\nc. Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos a computação em grade. \nd. Embora a grade conecte várias plataformas diferentes, ela pode ser acessada a partir de um único navegador da web, por exemplo.\n","resposta":"A resposta correta é: No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.."},{"pergunta":"O mercado de embarcados é aproximadamente 2 vezes maior que o de Desktops e deve diminuir exponencialmente na próxima década.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua interface e baixo custo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. Processador Broadcom BCM2837B0 \nb. 1GB LPDDR2 SDRAM\nc. Slot cartão micro SD\nd. 2 portas USB 2.0;\n","resposta":"A resposta correta é: 2 portas USB 2.0;."},{"pergunta":"Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos:\n\n","imagem":"","alternativas":"Escolha uma:\na. a clusterização. \nb. o Windows.\nc. a computação em grade.\nd. o Linux.\n","resposta":"A resposta correta é: a computação em grade.."},{"pergunta":"O primeiro Sistema Embarcado produzido em massa foi o:\n\n","imagem":"","alternativas":"Escolha uma:\na. Autoclick– Processador para controle de teclado da IBM\nb. Autonetics D-17 – Computador guia do míssil Minuteman \nc. Autotronic – Computador guia de automóveis\nd. Autonet– Computador guia de roteadores para Internet\n","resposta":"A resposta correta é: Autonetics D-17 – Computador guia do míssil Minuteman."},{"pergunta":"Um AGC (Automatic Gain Control), pode ser considerado um sistema embarcado de pequena capacidade, ele foi utilizado inicialmente como um sistema de controle:\n\n","imagem":"","alternativas":"Escolha uma:\na. na Apollo \nb. na Estação espacial russa\nc. no Big-Ben\nd. no Primeiro carro da Ford\n","resposta":"A resposta correta é: na Apollo."},{"pergunta":"Nos itens abaixo escolha o que não se relaciona a Camada de Hardware de uma arquitetura conceitual embarcada:\n\n","imagem":"","alternativas":"Escolha uma:\na. Memória ROM\nb. Interface IDE \nc. Processador Embarcado\nd. Memória RAM\n","resposta":"A resposta correta é: Interface IDE."},{"pergunta":"A respeito de ARM (Advanced RISC Machine), qual afirmação abaixo não é verdadeira:\n\n","imagem":"","alternativas":"Escolha uma:\na. Utilizados em gadgets compactos (smartphones, tablets, roteadores e calculadoras).\nb. Possui recursos de hardware reduzido em relação aos computadores tradicionais.\nc. Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final. \nd. Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico.\n","resposta":"A resposta correta é: Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final.."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua simples interface e custo baixo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. Conector de interface VGA\nb. 40-pin GPIO header\nc. Suporte a Power-over-Ethernet (PoE)\nd. Gigabit Ethernet over USB 2.0 \n","resposta":"A resposta correta é: Conector de interface VGA."},{"pergunta":"Um computador com um conjunto complexo de instruções (CISC) tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Muitas operações e Diferentes formatos e comprimentos de instruções \nb. Poucas operações e Diferentes formatos e comprimentos de instruções\nc. Muitas operações e idênticos formatos e comprimentos de instruções\nd. Muitas operações e Diferentes formatos e comprimentos de programas\n","resposta":"A resposta correta é: Muitas operações e Diferentes formatos e comprimentos de instruções."},{"pergunta":"Na computação em cluster, conectamos um grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como varias unidade de computação para resolver um problema comum de computação.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"A respeito da OMAP (Open Multimedia Applications Platform), qual item abaixo não é verdadeiro:\n\n","imagem":"","alternativas":"Escolha uma:\na. Desenvolvida para baixo desempenho. \nb. Faz parte da Família de processadores com arquitetura dual core (ARM + DSP(Digital Signal Processing))\nc. Desenvolvida para alto desempenho.\nd. Possui baixo consumo de energia.\n","resposta":"A resposta correta é: Desenvolvida para baixo desempenho.."},{"pergunta":"A respeito das similaridade entre Grid e Cluster, é incorreto afirmar que:\n\n","imagem":"","alternativas":"Escolha uma:\na. Essas duas técnicas buscam aumentar a eficiência e o rendimento por meio de redes de computadores.\nb. Essas duas técnicas economizam dinheiro porque conseguem otimizar os recurso.\nc. Essas duas técnicas atendem a mesma abrangem geográfica. \nd. Ambas as técnicas envolvem a solução de problemas de computação que não estão no escopo de um único computador, conectando computadores.\n","resposta":"A resposta correta é: Essas duas técnicas atendem a mesma abrangem geográfica.."},{"pergunta":"Realize a associação com os itens relacionados abaixo:\n\n","imagem":"","alternativas":"Camada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.)\n\nResposta 1 \nZ80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits)\n\nResposta 2 \nDesenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico\n\nResposta 3 \nAlguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial.\n\nResposta 4 \n","resposta":"A resposta correta é: Camada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.) → Arquitetura Conceitual, Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) → video-games, DVDs, Palms, injeção eletrônica, etc., Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico → ARM, Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial. → Sistemas embarcados."},{"pergunta":"O que melhor define uma Grid Computing é:\n\n","imagem":"","alternativas":"Escolha uma:\na. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo. \nb. Grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como uma única unidade de computação.\nc. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em serie.\nd. Componentes de computação similares conectados usando uma rede local rápida.\n","resposta":"A resposta correta é: Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo.."},{"pergunta":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem mais completos, fugindo ao conceito inicial de um sistema embarcado.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"O mercado de embarcados é aproximadamente 2 vezes maior que o de Desktops e deve diminuir exponencialmente na próxima década.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"O que melhor define uma Grid Computing é:\n\n","imagem":"","alternativas":"Escolha uma:\na. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em serie.\nb. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo. \nc. Grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como uma única unidade de computação.\nd. Componentes de computação similares conectados usando uma rede local rápida.\n","resposta":"A resposta correta é: Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo.."},{"pergunta":"O primeiro Sistema Embarcado produzido em massa foi o:\n\n","imagem":"","alternativas":"Escolha uma:\na. Autoclick Processador para controle de teclado da IBM \nb. Autotronic  Computador guia de automóveis\nc. Autonet Computador guia de roteadores para Internet\nd. Autonetics D-17  Computador guia do míssil Minuteman\n","resposta":"A resposta correta é: Autonetics D-17  Computador guia do míssil Minuteman."},{"pergunta":"Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos:\n\n","imagem":"","alternativas":"Escolha uma:\na. o Windows.\nb. o Linux.\nc. a clusterização.\nd. a computação em grade. \n","resposta":"A resposta correta é: a computação em grade.."},{"pergunta":"A respeito da OMAP (Open Multimedia Applications Platform), qual item abaixo não é verdadeiro:\n\n","imagem":"","alternativas":"Escolha uma:\na. Desenvolvida para baixo desempenho. \nb. Possui baixo consumo de energia.\nc. Desenvolvida para alto desempenho.\nd. Faz parte da Família de processadores com arquitetura dual core (ARM + DSP(Digital Signal Processing))\n","resposta":"A resposta correta é: Desenvolvida para baixo desempenho.."},{"pergunta":"Sobre a criação de uma estrutura de Grid Computing, qual alternativa abaixo não é correta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Um software que é capaz de dividir o programa em muitos computadores é utilizado para essa finalidade.\nb. Milhares de computadores são empregados no processo. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede.\nc. Todos os equipamentos estão conectados juntos usando a Internet.\nd. Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão. \n","resposta":"A resposta correta é: Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão.."},{"pergunta":"Alguns processadores antigos ainda são amplamente utilizados, como o Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) na construção de videogames, DVDs, Palms, injeção eletrônica, etc.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Um computador com um conjunto complexo de instruções (CISC) tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Muitas operações e Diferentes formatos e comprimentos de programas\nb. Poucas operações e Diferentes formatos e comprimentos de instruções\nc. Muitas operações e idênticos formatos e comprimentos de instruções\nd. Muitas operações e Diferentes formatos e comprimentos de instruções \n","resposta":"A resposta correta é: Muitas operações e Diferentes formatos e comprimentos de instruções."},{"pergunta":"A tendência para os sistemas embarcados é a adição de mais inteligência a processos e produtos, e maior conectividade, através de tecnologias de rede sem fio, por exemplo.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua simples interface e custo baixo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. 40-pin GPIO header\nb. Suporte a Power-over-Ethernet (PoE)\nc. Conector de interface VGA \nd. Gigabit Ethernet over USB 2.0\n","resposta":"A resposta correta é: Conector de interface VGA."},{"pergunta":"Realize a associação com os itens relacionados abaixo:\n\n","imagem":"","alternativas":"Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico\n\nResposta 1 \nAlguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial.\n\nResposta 2 \nCamada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.)\n\nResposta 3 \nZ80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits)\n\nResposta 4 \n","resposta":"A resposta correta é: Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico ? ARM, Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial. ? Sistemas embarcados, Camada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.) ? Arquitetura Conceitual, Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) ? video-games, DVDs, Palms, injeção eletrônica, etc.."},{"pergunta":" A respeito de Cluster, qual afirmação está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.\nb. Na tolerância a falhas, temos um sistema que é robusto o suficiente para lidar com falhas de hardware ou software. Mesmo se um nó falhar, a operação pode ser concluída por outros nós. O poder de computação do cluster é afetado quando um sistema está com falha, mas, no entanto, outros sistemas ainda estão disponíveis para executar a operação.\nc. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver. \nd. No balanceamento de carga, distribuímos tarefas de computação pelo cluster, de modo que uma única máquina não seja sobrecarregada com um processamento pesado que não pode ser feito.\n","resposta":"A resposta correta é: Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.."},{"pergunta":"A respeito de ARM (Advanced RISC Machine), qual afirmação abaixo não é verdadeira:\n\n","imagem":"","alternativas":"Escolha uma:\na. Utilizados em gadgets compactos (smartphones, tablets, roteadores e calculadoras).\nb. Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico.\nc. Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final. \nd. Possui recursos de hardware reduzido em relação aos computadores tradicionais.\n","resposta":"A resposta correta é: Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final.."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua interface e baixo custo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. Processador Broadcom BCM2837B0\nb. Slot cartão micro SD\nc. 1GB LPDDR2 SDRAM \nd. 2 portas USB 2.0;\n","resposta":"A resposta correta é: 2 portas USB 2.0;."},{"pergunta":"Nos itens abaixo escolha o que não se relaciona a Camada de Hardware de uma arquitetura conceitual embarcada:\n\n","imagem":"","alternativas":"Escolha uma:\na. Interface IDE \nb. Processador Embarcado\nc. Memória RAM\nd. Memória ROM\n","resposta":"A resposta correta é: Interface IDE."},{"pergunta":"Das afirmações sobre Grid, qual está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos a computação em grade.\nb. Embora a grade conecte várias plataformas diferentes, ela pode ser acessada a partir de um único navegador da web, por exemplo.\nc. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.\nd. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum. \n","resposta":"A resposta correta é: No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.."},{"pergunta":"Na computação em cluster, conectamos um grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como varias unidade de computação para resolver um problema comum de computação.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"A respeito das similaridade entre Grid e Cluster, é incorreto afirmar que:\n\n","imagem":"","alternativas":"Escolha uma:\na. Essas duas técnicas buscam aumentar a eficiência e o rendimento por meio de redes de computadores.\nb. Essas duas técnicas atendem a mesma abrangem geográfica. \nc. Ambas as técnicas envolvem a solução de problemas de computação que não estão no escopo de um único computador, conectando computadores.\nd. Essas duas técnicas economizam dinheiro porque conseguem otimizar os recurso.\n","resposta":"A resposta correta é: Essas duas técnicas atendem a mesma abrangem geográfica.."},{"pergunta":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem mais completos, fugindo ao conceito inicial de um sistema embarcado.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Um computador com um conjunto reduzido de instruções (RISC), tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Número reduzido de instruções e Mais Eficiência \nb. Número reduzido de instruções e Menos Eficiência\nc. Número maior de instruções e Mais Eficiência\nd. Número maior de instruções e Menos Eficiência\n","resposta":"A resposta correta é: Número reduzido de instruções e Mais Eficiência."},{"pergunta":"Alguns processadores antigos ainda são amplamente utilizados, como o Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) na construção de videogames, DVDs, Palms, injeção eletrônica, etc.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem mais completos, fugindo ao conceito inicial de um sistema embarcado.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos:\n\n","imagem":"","alternativas":"Escolha uma:\na. o Linux.\nb. a clusterização.\nc. o Windows.\nd. a computação em grade. \n","resposta":"A resposta correta é: a computação em grade.."},{"pergunta":"A tendência para os sistemas embarcados é a adição de mais inteligência a processos e produtos, e maior conectividade, através de tecnologias de rede sem fio, por exemplo.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"O mercado de embarcados é aproximadamente 2 vezes maior que o de Desktops e deve diminuir exponencialmente na próxima década.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Das afirmações sobre Grid, qual está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos a computação em grade.\nb. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum. \nc. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.\nd. Embora a grade conecte várias plataformas diferentes, ela pode ser acessada a partir de um único navegador da web, por exemplo.\n","resposta":"A resposta correta é: No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.."},{"pergunta":"Um computador com um conjunto reduzido de instruções (RISC), tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Número maior de instruções e Menos Eficiência\nb. Número reduzido de instruções e Menos Eficiência\nc. Número maior de instruções e Mais Eficiência\nd. Número reduzido de instruções e Mais Eficiência \n","resposta":"A resposta correta é: Número reduzido de instruções e Mais Eficiência."},{"pergunta":"O que melhor define uma Grid Computing é:\n\n","imagem":"","alternativas":"Escolha uma:\na. Grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como uma única unidade de computação.\nb. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo. \nc. Componentes de computação similares conectados usando uma rede local rápida.\nd. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em serie.\n","resposta":"A resposta correta é: Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo.."},{"pergunta":"Sobre a criação de uma estrutura de Grid Computing, qual alternativa abaixo não é correta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Todos os equipamentos estão conectados juntos usando a Internet.\nb. Um software que é capaz de dividir o programa em muitos computadores é utilizado para essa finalidade.\nc. Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão. \nd. Milhares de computadores são empregados no processo. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede.\n","resposta":"A resposta correta é: Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão.."},{"pergunta":"Realize a associação com os itens relacionados abaixo:\n\n","imagem":"","alternativas":"Camada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.)\n\nResposta 1 \nAlguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial.\n\nResposta 2 \nZ80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits)\n\nResposta 3 \nDesenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico\n\nResposta 4 \n","resposta":"A resposta correta é: Camada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.) ? Arquitetura Conceitual, Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial. ? Sistemas embarcados, Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) ? video-games, DVDs, Palms, injeção eletrônica, etc., Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico ? ARM."},{"pergunta":"Em uma Grid Computing são empregados no processo milhares de sistemas computacionais. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede. Para realizar a função \"Grid\" todos estão conectados usando apenas uma rede local.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"A respeito da OMAP (Open Multimedia Applications Platform), qual item abaixo não é verdadeiro:\n\n","imagem":"","alternativas":"Escolha uma:\na. Faz parte da Família de processadores com arquitetura dual core (ARM + DSP(Digital Signal Processing))\nb. Possui baixo consumo de energia.\nc. Desenvolvida para alto desempenho.\nd. Desenvolvida para baixo desempenho. \n","resposta":"A resposta correta é: Desenvolvida para baixo desempenho.."},{"pergunta":"A respeito de ARM (Advanced RISC Machine), qual afirmação abaixo não é verdadeira:\n\n","imagem":"","alternativas":"Escolha uma:\na. Utilizados em gadgets compactos (smartphones, tablets, roteadores e calculadoras).\nb. Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico.\nc. Possui recursos de hardware reduzido em relação aos computadores tradicionais.\nd. Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final. \n","resposta":"A resposta correta é: Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final.."},{"pergunta":"Devido aos constantes avanços na tecnologia e a queda nos custos de implementação tanto de componentes de software como hardware, a definição de Sistemas Embarcados está bem definida.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Na computação em cluster, conectamos um grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como varias unidade de computação para resolver um problema comum de computação.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Nos itens abaixo escolha o que não se relaciona a Camada de Hardware de uma arquitetura conceitual embarcada:\n\n","imagem":"","alternativas":"Escolha uma:\na. Processador Embarcado\nb. Memória RAM\nc. Memória ROM\nd. Interface IDE \n","resposta":"A resposta correta é: Interface IDE."},{"pergunta":"Um computador com um conjunto complexo de instruções (CISC) tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Poucas operações e Diferentes formatos e comprimentos de instruções\nb. Muitas operações e Diferentes formatos e comprimentos de programas\nc. Muitas operações e Diferentes formatos e comprimentos de instruções \nd. Muitas operações e idênticos formatos e comprimentos de instruções\n","resposta":"A resposta correta é: Muitas operações e Diferentes formatos e comprimentos de instruções."},{"pergunta":"Um AGC (Automatic Gain Control), pode ser considerado um sistema embarcado de pequena capacidade, ele foi utilizado inicialmente como um sistema de controle:\n\n","imagem":"","alternativas":"Escolha uma:\na. na Estação espacial russa\nb. no Big-Ben\nc. no Primeiro carro da Ford\nd. na Apollo \n","resposta":"A resposta correta é: na Apollo."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua simples interface e custo baixo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. Conector de interface VGA \nb. 40-pin GPIO header\nc. Suporte a Power-over-Ethernet (PoE)\nd. Gigabit Ethernet over USB 2.0\n","resposta":"A resposta correta é: Conector de interface VGA."},{"pergunta":"O primeiro Sistema Embarcado produzido em massa foi o:\n\n","imagem":"","alternativas":"Escolha uma:\na. Autotronic  Computador guia de automóveis\nb. Autonetics D-17  Computador guia do míssil Minuteman \nc. Autoclick Processador para controle de teclado da IBM\nd. Autonet Computador guia de roteadores para Internet\n","resposta":"A resposta correta é: Autonetics D-17  Computador guia do míssil Minuteman."},{"pergunta":"A respeito de ARM (Advanced RISC Machine), qual afirmação abaixo não é verdadeira:\n\n","imagem":"","alternativas":"Escolha uma:\na. Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final. \nb. Utilizados em gadgets compactos (smartphones, tablets, roteadores e calculadoras).\nc. Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico.\nd. Possui recursos de hardware reduzido em relação aos computadores tradicionais.\n","resposta":"A resposta correta é: Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final.."},{"pergunta":"A respeito das similaridade entre Grid e Cluster, é incorreto afirmar que:\n\n","imagem":"","alternativas":"Escolha uma:\na. Essas duas técnicas economizam dinheiro porque conseguem otimizar os recurso.\nb. Ambas as técnicas envolvem a solução de problemas de computação que não estão no escopo de um único computador, conectando computadores.\nc. Essas duas técnicas buscam aumentar a eficiência e o rendimento por meio de redes de computadores.\nd. Essas duas técnicas atendem a mesma abrangem geográfica. \n","resposta":"A resposta correta é: Essas duas técnicas atendem a mesma abrangem geográfica.."},{"pergunta":"A tendência para os sistemas embarcados é a adição de mais inteligência a processos e produtos, e maior conectividade, através de tecnologias de rede sem fio, por exemplo.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"O primeiro Sistema Embarcado produzido em massa foi o:\n\n","imagem":"","alternativas":"Escolha uma:\na. Autotronic – Computador guia de automóveis\nb. Autoclick– Processador para controle de teclado da IBM\nc. Autonetics D-17 – Computador guia do míssil Minuteman \nd. Autonet– Computador guia de roteadores para Internet\n","resposta":"A resposta correta é: Autonetics D-17 – Computador guia do míssil Minuteman."},{"pergunta":"Sobre a criação de uma estrutura de Grid Computing, qual alternativa abaixo não é correta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Um software que é capaz de dividir o programa em muitos computadores é utilizado para essa finalidade.\nb. Milhares de computadores são empregados no processo. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede.\nc. Todos os equipamentos estão conectados juntos usando a Internet.\nd. Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão. \n","resposta":"A resposta correta é: Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão.."},{"pergunta":"Nos itens abaixo escolha o que não se relaciona a Camada de Hardware de uma arquitetura conceitual embarcada:\n\n","imagem":"","alternativas":"Escolha uma:\na. Processador Embarcado\nb. Memória ROM\nc. Memória RAM\nd. Interface IDE \n","resposta":"A resposta correta é: Interface IDE."},{"pergunta":"Na computação em cluster, conectamos um grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como varias unidade de computação para resolver um problema comum de computação.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua simples interface e custo baixo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. Suporte a Power-over-Ethernet (PoE)\nb. 40-pin GPIO header\nc. Gigabit Ethernet over USB 2.0\nd. Conector de interface VGA \n","resposta":"A resposta correta é: Conector de interface VGA."},{"pergunta":"Realize a associação com os itens relacionados abaixo:\n\n","imagem":"","alternativas":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial.\n\nResposta 1 \nCamada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.)\n\nResposta 2 \nDesenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico\n\nResposta 3 \nZ80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits)\n\nResposta 4 \n","resposta":"A resposta correta é: Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial. → Sistemas embarcados, Camada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.) → Arquitetura Conceitual, Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico → ARM, Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) → video-games, DVDs, Palms, injeção eletrônica, etc.."},{"pergunta":"O mercado de embarcados é aproximadamente 2 vezes maior que o de Desktops e deve diminuir exponencialmente na próxima década.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":" A respeito de Cluster, qual afirmação está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. No balanceamento de carga, distribuímos tarefas de computação pelo cluster, de modo que uma única máquina não seja sobrecarregada com um processamento pesado que não pode ser feito.\nb. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.\nc. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver. \nd. Na tolerância a falhas, temos um sistema que é robusto o suficiente para lidar com falhas de hardware ou software. Mesmo se um nó falhar, a operação pode ser concluída por outros nós. O poder de computação do cluster é afetado quando um sistema está com falha, mas, no entanto, outros sistemas ainda estão disponíveis para executar a operação.\n","resposta":"A resposta correta é: Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.."},{"pergunta":"Um AGC (Automatic Gain Control), pode ser considerado um sistema embarcado de pequena capacidade, ele foi utilizado inicialmente como um sistema de controle:\n\n","imagem":"","alternativas":"Escolha uma:\na. na Apollo \nb. no Big-Ben\nc. no Primeiro carro da Ford\nd. na Estação espacial russa\n","resposta":"A resposta correta é: na Apollo."},{"pergunta":"Devido aos constantes avanços na tecnologia e a queda nos custos de implementação tanto de componentes de software como hardware, a definição de Sistemas Embarcados está bem definida.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem mais completos, fugindo ao conceito inicial de um sistema embarcado.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Um computador com um conjunto reduzido de instruções (RISC), tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Número reduzido de instruções e Mais Eficiência \nb. Número maior de instruções e Mais Eficiência\nc. Número maior de instruções e Menos Eficiência\nd. Número reduzido de instruções e Menos Eficiência\n","resposta":"A resposta correta é: Número reduzido de instruções e Mais Eficiência."},{"pergunta":"Alguns processadores antigos ainda são amplamente utilizados, como o Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) na construção de videogames, DVDs, Palms, injeção eletrônica, etc.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Das afirmações sobre Grid, qual está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos a computação em grade.\nb. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.\nc. Embora a grade conecte várias plataformas diferentes, ela pode ser acessada a partir de um único navegador da web, por exemplo.\nd. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum. \n","resposta":"A resposta correta é: No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.."},{"pergunta":"Um computador com um conjunto complexo de instruções (CISC) tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Muitas operações e Diferentes formatos e comprimentos de programas\nb. Poucas operações e Diferentes formatos e comprimentos de instruções\nc. Muitas operações e Diferentes formatos e comprimentos de instruções \nd. Muitas operações e idênticos formatos e comprimentos de instruções\n","resposta":"A resposta correta é: Muitas operações e Diferentes formatos e comprimentos de instruções."},{"pergunta":"O que melhor define uma Grid Computing é:\n\n","imagem":"","alternativas":"Escolha uma:\na. Grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como uma única unidade de computação.\nb. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo. \nc. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em serie.\nd. Componentes de computação similares conectados usando uma rede local rápida.\n","resposta":"A resposta correta é: Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo.."},{"pergunta":"Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos:\n\n","imagem":"","alternativas":"Escolha uma:\na. a clusterização. \nb. o Linux.\nc. a computação em grade.\nd. o Windows.\n","resposta":"A resposta correta é: a computação em grade.."},{"pergunta":"Devido aos constantes avanços na tecnologia e a queda nos custos de implementação tanto de componentes de software como hardware, a definição de Sistemas Embarcados está bem definida.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Das afirmações sobre Grid, qual está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum. \nb. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.\nc. Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos a computação em grade.\nd. Embora a grade conecte várias plataformas diferentes, ela pode ser acessada a partir de um único navegador da web, por exemplo.\n","resposta":"A resposta correta é: No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.."},{"pergunta":"Na computação em cluster, conectamos um grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como varias unidade de computação para resolver um problema comum de computação.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua interface e baixo custo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. Slot cartão micro SD\nb. 1GB LPDDR2 SDRAM\nc. Processador Broadcom BCM2837B0\nd. 2 portas USB 2.0; \n","resposta":"A resposta correta é: 2 portas USB 2.0;."},{"pergunta":"Em uma Grid Computing são empregados no processo milhares de sistemas computacionais. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede. Para realizar a função \"Grid\" todos estão conectados usando apenas uma rede local.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos:\n\n","imagem":"","alternativas":"Escolha uma:\na. a clusterização.\nb. o Windows.\nc. o Linux.\nd. a computação em grade. \n","resposta":"A resposta correta é: a computação em grade.."},{"pergunta":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem mais completos, fugindo ao conceito inicial de um sistema embarcado.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"A respeito das similaridade entre Grid e Cluster, é incorreto afirmar que:\n\n","imagem":"","alternativas":"Escolha uma:\na. Ambas as técnicas envolvem a solução de problemas de computação que não estão no escopo de um único computador, conectando computadores.\nb. Essas duas técnicas atendem a mesma abrangem geográfica. \nc. Essas duas técnicas economizam dinheiro porque conseguem otimizar os recurso.\nd. Essas duas técnicas buscam aumentar a eficiência e o rendimento por meio de redes de computadores.\n","resposta":"A resposta correta é: Essas duas técnicas atendem a mesma abrangem geográfica.."},{"pergunta":"A respeito da OMAP (Open Multimedia Applications Platform), qual item abaixo não é verdadeiro:\n\n","imagem":"","alternativas":"Escolha uma:\na. Faz parte da Família de processadores com arquitetura dual core (ARM + DSP(Digital Signal Processing))\nb. Desenvolvida para baixo desempenho. \nc. Possui baixo consumo de energia.\nd. Desenvolvida para alto desempenho.\n","resposta":"A resposta correta é: Desenvolvida para baixo desempenho.."},{"pergunta":"Um computador com um conjunto complexo de instruções (CISC) tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Muitas operações e Diferentes formatos e comprimentos de programas\nb. Poucas operações e Diferentes formatos e comprimentos de instruções\nc. Muitas operações e idênticos formatos e comprimentos de instruções\nd. Muitas operações e Diferentes formatos e comprimentos de instruções \n","resposta":"A resposta correta é: Muitas operações e Diferentes formatos e comprimentos de instruções."},{"pergunta":"Realize a associação com os itens relacionados abaixo:\n\n","imagem":"","alternativas":"Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits)\n\nResposta 1\nDesenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico\n\nResposta 2\nCamada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.)\n\nResposta 3\nAlguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial.\n\nResposta 4\n","resposta":"A resposta correta é: Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) ? video-games, DVDs, Palms, injeção eletrônica, etc., Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico ? ARM, Camada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.) ? Arquitetura Conceitual, Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial. ? Sistemas embarcados."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua simples interface e custo baixo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. Gigabit Ethernet over USB 2.0\nb. Suporte a Power-over-Ethernet (PoE)\nc. 40-pin GPIO header\nd. Conector de interface VGA \n","resposta":"A resposta correta é: Conector de interface VGA."},{"pergunta":"Um computador com um conjunto reduzido de instruções (RISC), tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Número maior de instruções e Menos Eficiência\nb. Número maior de instruções e Mais Eficiência\nc. Número reduzido de instruções e Mais Eficiência \nd. Número reduzido de instruções e Menos Eficiência\n","resposta":"A resposta correta é: Número reduzido de instruções e Mais Eficiência."},{"pergunta":"A tendência para os sistemas embarcados é a adição de mais inteligência a processos e produtos, e maior conectividade, através de tecnologias de rede sem fio, por exemplo.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Alguns processadores antigos ainda são amplamente utilizados, como o Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) na construção de videogames, DVDs, Palms, injeção eletrônica, etc.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":" A respeito de Cluster, qual afirmação está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver. \nb. No balanceamento de carga, distribuímos tarefas de computação pelo cluster, de modo que uma única máquina não seja sobrecarregada com um processamento pesado que não pode ser feito.\nc. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.\nd. Na tolerância a falhas, temos um sistema que é robusto o suficiente para lidar com falhas de hardware ou software. Mesmo se um nó falhar, a operação pode ser concluída por outros nós. O poder de computação do cluster é afetado quando um sistema está com falha, mas, no entanto, outros sistemas ainda estão disponíveis para executar a operação.\n","resposta":"A resposta correta é: Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.."},{"pergunta":"O que melhor define uma Grid Computing é:\n\n","imagem":"","alternativas":"Escolha uma:\na. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo. \nb. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em serie.\nc. Grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como uma única unidade de computação.\nd. Componentes de computação similares conectados usando uma rede local rápida.\n","resposta":"A resposta correta é: Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo.."},{"pergunta":"O primeiro Sistema Embarcado produzido em massa foi o:\n\n","imagem":"","alternativas":"Escolha uma:\na. Autotronic  Computador guia de automóveis\nb. Autonetics D-17  Computador guia do míssil Minuteman \nc. Autoclick Processador para controle de teclado da IBM\nd. Autonet Computador guia de roteadores para Internet\n","resposta":"A resposta correta é: Autonetics D-17  Computador guia do míssil Minuteman."},{"pergunta":"Nos itens abaixo escolha o que não se relaciona a Camada de Hardware de uma arquitetura conceitual embarcada:\n\n","imagem":"","alternativas":"Escolha uma:\na. Memória RAM\nb. Memória ROM\nc. Processador Embarcado\nd. Interface IDE \n","resposta":"A resposta correta é: Interface IDE."},{"pergunta":"Um AGC (Automatic Gain Control), pode ser considerado um sistema embarcado de pequena capacidade, ele foi utilizado inicialmente como um sistema de controle:\n\n","imagem":"","alternativas":"Escolha uma:\na. na Estação espacial russa\nb. na Apollo \nc. no Big-Ben\nd. no Primeiro carro da Ford\n","resposta":"A resposta correta é: na Apollo."},{"pergunta":"A tendência para os sistemas embarcados é a adição de mais inteligência a processos e produtos, e maior conectividade, através de tecnologias de rede sem fio, por exemplo.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"A respeito das similaridade entre Grid e Cluster, é incorreto afirmar que:\n\n","imagem":"","alternativas":"Escolha uma:\na. Essas duas técnicas buscam aumentar a eficiência e o rendimento por meio de redes de computadores.\nb. Essas duas técnicas economizam dinheiro porque conseguem otimizar os recurso.\nc. Essas duas técnicas atendem a mesma abrangem geográfica. \nd. Ambas as técnicas envolvem a solução de problemas de computação que não estão no escopo de um único computador, conectando computadores.\n","resposta":"A resposta correta é: Essas duas técnicas atendem a mesma abrangem geográfica.."},{"pergunta":"A respeito da OMAP (Open Multimedia Applications Platform), qual item abaixo não é verdadeiro:\n\n","imagem":"","alternativas":"Escolha uma:\na. Possui baixo consumo de energia.\nb. Desenvolvida para baixo desempenho. \nc. Desenvolvida para alto desempenho.\nd. Faz parte da Família de processadores com arquitetura dual core (ARM + DSP(Digital Signal Processing))\n","resposta":"A resposta correta é: Desenvolvida para baixo desempenho.."},{"pergunta":"Na computação em cluster, conectamos um grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como varias unidade de computação para resolver um problema comum de computação.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Um computador com um conjunto complexo de instruções (CISC) tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Poucas operações e Diferentes formatos e comprimentos de instruções \nb. Muitas operações e Diferentes formatos e comprimentos de programas\nc. Muitas operações e idênticos formatos e comprimentos de instruções\nd. Muitas operações e Diferentes formatos e comprimentos de instruções\n","resposta":"A resposta correta é: Muitas operações e Diferentes formatos e comprimentos de instruções."},{"pergunta":"O primeiro Sistema Embarcado produzido em massa foi o:\n\n","imagem":"","alternativas":"Escolha uma:\na. Autotronic – Computador guia de automóveis \nb. Autonet– Computador guia de roteadores para Internet\nc. Autoclick– Processador para controle de teclado da IBM\nd. Autonetics D-17 – Computador guia do míssil Minuteman\n","resposta":"A resposta correta é: Autonetics D-17 – Computador guia do míssil Minuteman."},{"pergunta":"O mercado de embarcados é aproximadamente 2 vezes maior que o de Desktops e deve diminuir exponencialmente na próxima década.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":" A respeito de Cluster, qual afirmação está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver. \nb. No balanceamento de carga, distribuímos tarefas de computação pelo cluster, de modo que uma única máquina não seja sobrecarregada com um processamento pesado que não pode ser feito.\nc. Na tolerância a falhas, temos um sistema que é robusto o suficiente para lidar com falhas de hardware ou software. Mesmo se um nó falhar, a operação pode ser concluída por outros nós. O poder de computação do cluster é afetado quando um sistema está com falha, mas, no entanto, outros sistemas ainda estão disponíveis para executar a operação.\nd. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.\n","resposta":"A resposta correta é: Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.."},{"pergunta":"Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos:\n\n","imagem":"","alternativas":"Escolha uma:\na. a clusterização.\nb. a computação em grade. \nc. o Linux.\nd. o Windows.\n","resposta":"A resposta correta é: a computação em grade.."},{"pergunta":"A respeito de ARM (Advanced RISC Machine), qual afirmação abaixo não é verdadeira:\n\n","imagem":"","alternativas":"Escolha uma:\na. Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final. \nb. Possui recursos de hardware reduzido em relação aos computadores tradicionais.\nc. Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico.\nd. Utilizados em gadgets compactos (smartphones, tablets, roteadores e calculadoras).\n","resposta":"A resposta correta é: Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final.."},{"pergunta":"O que melhor define uma Grid Computing é:\n\n","imagem":"","alternativas":"Escolha uma:\na. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em serie.\nb. Componentes de computação similares conectados usando uma rede local rápida.\nc. Grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como uma única unidade de computação.\nd. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo. \n","resposta":"A resposta correta é: Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo.."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua interface e baixo custo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. 1GB LPDDR2 SDRAM\nb. Slot cartão micro SD\nc. Processador Broadcom BCM2837B0\nd. 2 portas USB 2.0; \n","resposta":"A resposta correta é: 2 portas USB 2.0;."},{"pergunta":"Devido aos constantes avanços na tecnologia e a queda nos custos de implementação tanto de componentes de software como hardware, a definição de Sistemas Embarcados está bem definida.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Sobre a criação de uma estrutura de Grid Computing, qual alternativa abaixo não é correta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Todos os equipamentos estão conectados juntos usando a Internet.\nb. Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão. \nc. Milhares de computadores são empregados no processo. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede.\nd. Um software que é capaz de dividir o programa em muitos computadores é utilizado para essa finalidade.\n","resposta":"A resposta correta é: Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão.."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua simples interface e custo baixo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. 40-pin GPIO header\nb. Suporte a Power-over-Ethernet (PoE)\nc. Conector de interface VGA\nd. Gigabit Ethernet over USB 2.0 \n","resposta":"A resposta correta é: Conector de interface VGA."},{"pergunta":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem mais completos, fugindo ao conceito inicial de um sistema embarcado.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Realize a associação com os itens relacionados abaixo:\n\n","imagem":"","alternativas":"Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits)\n\nResposta 1\nCamada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.)\n\nResposta 2\nAlguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial.\n\nResposta 3\nDesenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico\n\nResposta 4\n","resposta":"A resposta correta é: Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) → video-games, DVDs, Palms, injeção eletrônica, etc., Camada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.) → Arquitetura Conceitual, Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial. → Sistemas embarcados, Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico → ARM."},{"pergunta":"Um computador com um conjunto reduzido de instruções (RISC), tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Número reduzido de instruções e Menos Eficiência\nb. Número reduzido de instruções e Mais Eficiência \nc. Número maior de instruções e Mais Eficiência\nd. Número maior de instruções e Menos Eficiência\n","resposta":"A resposta correta é: Número reduzido de instruções e Mais Eficiência."},{"pergunta":"Um AGC (Automatic Gain Control), pode ser considerado um sistema embarcado de pequena capacidade, ele foi utilizado inicialmente como um sistema de controle:\n\n","imagem":"","alternativas":"Escolha uma:\na. no Big-Ben \nb. no Primeiro carro da Ford\nc. na Estação espacial russa\nd. na Apollo\n","resposta":"A resposta correta é: na Apollo."},{"pergunta":"Nos itens abaixo escolha o que não se relaciona a Camada de Hardware de uma arquitetura conceitual embarcada:\n\n","imagem":"","alternativas":"Escolha uma:\na. Processador Embarcado\nb. Memória RAM\nc. Interface IDE \nd. Memória ROM\n","resposta":"A resposta correta é: Interface IDE."},{"pergunta":"Alguns processadores antigos ainda são amplamente utilizados, como o Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) na construção de videogames, DVDs, Palms, injeção eletrônica, etc.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Um computador com um conjunto reduzido de instruções (RISC), tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Número reduzido de instruções e Mais Eficiência \nb. Número maior de instruções e Mais Eficiência\nc. Número reduzido de instruções e Menos Eficiência\nd. Número maior de instruções e Menos Eficiência\n","resposta":"A resposta correta é: Número reduzido de instruções e Mais Eficiência."},{"pergunta":"Nos itens abaixo escolha o que não se relaciona a Camada de Hardware de uma arquitetura conceitual embarcada:\n\n","imagem":"","alternativas":"Escolha uma:\na. Interface IDE \nb. Memória ROM\nc. Processador Embarcado\nd. Memória RAM\n","resposta":"A resposta correta é: Interface IDE."},{"pergunta":"A respeito de ARM (Advanced RISC Machine), qual afirmação abaixo não é verdadeira:\n\n","imagem":"","alternativas":"Escolha uma:\na. Possui recursos de hardware reduzido em relação aos computadores tradicionais.\nb. Utilizados em gadgets compactos (smartphones, tablets, roteadores e calculadoras).\nc. Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico.\nd. Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final. \n","resposta":"A resposta correta é: Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final.."},{"pergunta":"A respeito das similaridade entre Grid e Cluster, é incorreto afirmar que:\n\n","imagem":"","alternativas":"Escolha uma:\na. Essas duas técnicas atendem a mesma abrangem geográfica. \nb. Essas duas técnicas buscam aumentar a eficiência e o rendimento por meio de redes de computadores.\nc. Ambas as técnicas envolvem a solução de problemas de computação que não estão no escopo de um único computador, conectando computadores.\nd. Essas duas técnicas economizam dinheiro porque conseguem otimizar os recurso.\n","resposta":"A resposta correta é: Essas duas técnicas atendem a mesma abrangem geográfica.."},{"pergunta":"Um computador com um conjunto complexo de instruções (CISC) tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Muitas operações e Diferentes formatos e comprimentos de programas\nb. Muitas operações e Diferentes formatos e comprimentos de instruções \nc. Muitas operações e idênticos formatos e comprimentos de instruções\nd. Poucas operações e Diferentes formatos e comprimentos de instruções\n","resposta":"A resposta correta é: Muitas operações e Diferentes formatos e comprimentos de instruções."},{"pergunta":"O mercado de embarcados é aproximadamente 2 vezes maior que o de Desktops e deve diminuir exponencialmente na próxima década.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Das afirmações sobre Grid, qual está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.\nb. Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos a computação em grade.\nc. Embora a grade conecte várias plataformas diferentes, ela pode ser acessada a partir de um único navegador da web, por exemplo. \nd. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.\n","resposta":"A resposta correta é: No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.."},{"pergunta":"Na computação em cluster, conectamos um grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como varias unidade de computação para resolver um problema comum de computação.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Realize a associação com os itens relacionados abaixo:\n\n","imagem":"","alternativas":"Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits)\n\nResposta 1 \nCamada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.)\n\nResposta 2 \nDesenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico\n\nResposta 3 \nAlguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial.\n\nResposta 4 \n","resposta":"A resposta correta é: Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) → video-games, DVDs, Palms, injeção eletrônica, etc., Camada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.) → Arquitetura Conceitual, Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico → ARM, Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial. → Sistemas embarcados."},{"pergunta":"A tendência para os sistemas embarcados é a adição de mais inteligência a processos e produtos, e maior conectividade, através de tecnologias de rede sem fio, por exemplo.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Sobre a criação de uma estrutura de Grid Computing, qual alternativa abaixo não é correta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Todos os equipamentos estão conectados juntos usando a Internet.\nb. Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão. \nc. Milhares de computadores são empregados no processo. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede.\nd. Um software que é capaz de dividir o programa em muitos computadores é utilizado para essa finalidade.\n","resposta":"A resposta correta é: Todos os computadores conectados devem possuir o mesmo sistema operacional, para garantir a estabilidade da conexão.."},{"pergunta":"Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos:\n\n","imagem":"","alternativas":"Escolha uma:\na. o Linux.\nb. a clusterização. \nc. o Windows.\nd. a computação em grade.\n","resposta":"A resposta correta é: a computação em grade.."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua simples interface e custo baixo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. Conector de interface VGA \nb. 40-pin GPIO header\nc. Gigabit Ethernet over USB 2.0\nd. Suporte a Power-over-Ethernet (PoE)\n","resposta":"A resposta correta é: Conector de interface VGA."},{"pergunta":" A respeito de Cluster, qual afirmação está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. No balanceamento de carga, distribuímos tarefas de computação pelo cluster, de modo que uma única máquina não seja sobrecarregada com um processamento pesado que não pode ser feito.\nb. Na tolerância a falhas, temos um sistema que é robusto o suficiente para lidar com falhas de hardware ou software. Mesmo se um nó falhar, a operação pode ser concluída por outros nós. O poder de computação do cluster é afetado quando um sistema está com falha, mas, no entanto, outros sistemas ainda estão disponíveis para executar a operação.\nc. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver. \nd. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.\n","resposta":"A resposta correta é: Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.."},{"pergunta":"Devido aos constantes avanços na tecnologia e a queda nos custos de implementação tanto de componentes de software como hardware, a definição de Sistemas Embarcados está bem definida.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"O que melhor define uma Grid Computing é:\n\n","imagem":"","alternativas":"Escolha uma:\na. Componentes de computação similares conectados usando uma rede local rápida.\nb. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em serie.\nc. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo. \nd. Grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como uma única unidade de computação.\n","resposta":"A resposta correta é: Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo.."},{"pergunta":"Um AGC (Automatic Gain Control), pode ser considerado um sistema embarcado de pequena capacidade, ele foi utilizado inicialmente como um sistema de controle:\n\n","imagem":"","alternativas":"Escolha uma:\na. na Estação espacial russa\nb. na Apollo \nc. no Primeiro carro da Ford\nd. no Big-Ben\n","resposta":"A resposta correta é: na Apollo."},{"pergunta":"Em uma Grid Computing são empregados no processo milhares de sistemas computacionais. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede. Para realizar a função \"Grid\" todos estão conectados usando apenas uma rede local.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua interface e baixo custo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. Slot cartão micro SD\nb. 2 portas USB 2.0; \nc. Processador Broadcom BCM2837B0\nd. 1GB LPDDR2 SDRAM\n","resposta":"A resposta correta é: 2 portas USB 2.0;."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua interface e baixo custo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. Slot cartão micro SD\nb. Processador Broadcom BCM2837B0\nc. 1GB LPDDR2 SDRAM\nd. 2 portas USB 2.0; \n","resposta":"A resposta correta é: 2 portas USB 2.0;."},{"pergunta":"Devido aos constantes avanços na tecnologia e a queda nos custos de implementação tanto de componentes de software como hardware, a definição de Sistemas Embarcados está bem definida.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Um computador com um conjunto reduzido de instruções (RISC), tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Número reduzido de instruções e Mais Eficiência \nb. Número maior de instruções e Menos Eficiência\nc. Número maior de instruções e Mais Eficiência\nd. Número reduzido de instruções e Menos Eficiência\n","resposta":"A resposta correta é: Número reduzido de instruções e Mais Eficiência."},{"pergunta":"Das afirmações sobre Grid, qual está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum. \nb. Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos a computação em grade.\nc. Embora a grade conecte várias plataformas diferentes, ela pode ser acessada a partir de um único navegador da web, por exemplo.\nd. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.\n","resposta":"A resposta correta é: No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.."},{"pergunta":"A respeito de ARM (Advanced RISC Machine), qual afirmação abaixo não é verdadeira:\n\n","imagem":"","alternativas":"Escolha uma:\na. Utilizados em gadgets compactos (smartphones, tablets, roteadores e calculadoras).\nb. Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico.\nc. Possui recursos de hardware reduzido em relação aos computadores tradicionais.\nd. Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final. \n","resposta":"A resposta correta é: Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final.."},{"pergunta":"Realize a associação com os itens relacionados abaixo:\n\n","imagem":"","alternativas":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial.\n\nResposta 1 \nDesenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico\n\nResposta 2 \nCamada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.)\n\nResposta 3 \nZ80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits)\n\nResposta 4 \n","resposta":"A resposta correta é: Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial. → Sistemas embarcados, Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico → ARM, Camada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.) → Arquitetura Conceitual, Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) → video-games, DVDs, Palms, injeção eletrônica, etc.."},{"pergunta":"Nos itens abaixo escolha o que não se relaciona a Camada de Hardware de uma arquitetura conceitual embarcada:\n\n","imagem":"","alternativas":"Escolha uma:\na. Processador Embarcado\nb. Memória RAM\nc. Interface IDE \nd. Memória ROM\n","resposta":"A resposta correta é: Interface IDE."},{"pergunta":"A tendência para os sistemas embarcados é a adição de mais inteligência a processos e produtos, e maior conectividade, através de tecnologias de rede sem fio, por exemplo.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"A respeito das similaridade entre Grid e Cluster, é incorreto afirmar que:\n\n","imagem":"","alternativas":"Escolha uma:\na. Ambas as técnicas envolvem a solução de problemas de computação que não estão no escopo de um único computador, conectando computadores.\nb. Essas duas técnicas atendem a mesma abrangem geográfica. \nc. Essas duas técnicas buscam aumentar a eficiência e o rendimento por meio de redes de computadores.\nd. Essas duas técnicas economizam dinheiro porque conseguem otimizar os recurso.\n","resposta":"A resposta correta é: Essas duas técnicas atendem a mesma abrangem geográfica.."},{"pergunta":"O primeiro Sistema Embarcado produzido em massa foi o:\n\n","imagem":"","alternativas":"Escolha uma:\na. Autoclick– Processador para controle de teclado da IBM\nb. Autotronic – Computador guia de automóveis\nc. Autonet– Computador guia de roteadores para Internet\nd. Autonetics D-17 – Computador guia do míssil Minuteman \n","resposta":"A resposta correta é: Autonetics D-17 – Computador guia do míssil Minuteman."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua simples interface e custo baixo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. Gigabit Ethernet over USB 2.0\nb. 40-pin GPIO header\nc. Conector de interface VGA \nd. Suporte a Power-over-Ethernet (PoE)\n","resposta":"A resposta correta é: Conector de interface VGA."},{"pergunta":"Um AGC (Automatic Gain Control), pode ser considerado um sistema embarcado de pequena capacidade, ele foi utilizado inicialmente como um sistema de controle:\n\n","imagem":"","alternativas":"Escolha uma:\na. na Apollo \nb. na Estação espacial russa\nc. no Primeiro carro da Ford\nd. no Big-Ben\n","resposta":"A resposta correta é: na Apollo."},{"pergunta":"Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos:\n\n","imagem":"","alternativas":"Escolha uma:\na. o Linux.\nb. o Windows.\nc. a clusterização.\nd. a computação em grade. \n","resposta":"A resposta correta é: a computação em grade.."},{"pergunta":"O mercado de embarcados é aproximadamente 2 vezes maior que o de Desktops e deve diminuir exponencialmente na próxima década.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem mais completos, fugindo ao conceito inicial de um sistema embarcado.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Alguns processadores antigos ainda são amplamente utilizados, como o Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) na construção de videogames, DVDs, Palms, injeção eletrônica, etc.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"O que melhor define uma Grid Computing é:\n\n","imagem":"","alternativas":"Escolha uma:\na. Componentes de computação similares conectados usando uma rede local rápida.\nb. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo. \nc. Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em serie.\nd. Grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como uma única unidade de computação.\n","resposta":"A resposta correta é: Tecnologia na qual utilizamos os recursos de muitos computadores em uma rede para resolver um único problema de computação ao mesmo tempo, ou seja, em paralelo.."},{"pergunta":"Um computador com um conjunto complexo de instruções (CISC) tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Muitas operações e Diferentes formatos e comprimentos de programas\nb. Muitas operações e Diferentes formatos e comprimentos de instruções \nc. Muitas operações e idênticos formatos e comprimentos de instruções\nd. Poucas operações e Diferentes formatos e comprimentos de instruções\n","resposta":"A resposta correta é: Muitas operações e Diferentes formatos e comprimentos de instruções."},{"pergunta":"Na computação em cluster, conectamos um grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como varias unidade de computação para resolver um problema comum de computação.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"A respeito da OMAP (Open Multimedia Applications Platform), qual item abaixo não é verdadeiro:\n\n","imagem":"","alternativas":"Escolha uma:\na. Faz parte da Família de processadores com arquitetura dual core (ARM + DSP(Digital Signal Processing))\nb. Desenvolvida para alto desempenho.\nc. Desenvolvida para baixo desempenho. \nd. Possui baixo consumo de energia.\n","resposta":"A resposta correta é: Desenvolvida para baixo desempenho.."},{"pergunta":"Devido aos constantes avanços na tecnologia e a queda nos custos de implementação tanto de componentes de software como hardware, a definição de Sistemas Embarcados está bem definida.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Atualmente o Raspberry Pi 3 é muito utilizado na educação, decorrente de sua interface e baixo custo, qual característica descrita abaixo não pertence a versão 3: \n\n","imagem":"","alternativas":"Escolha uma:\na. Processador Broadcom BCM2837B0\nb. 1GB LPDDR2 SDRAM\nc. Slot cartão micro SD\nd. 2 portas USB 2.0; \n","resposta":"A resposta correta é: 2 portas USB 2.0;."},{"pergunta":"Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos:\n\n","imagem":"","alternativas":"Escolha uma:\na. o Windows.\nb. o Linux.\nc. a clusterização.\nd. a computação em grade. \n","resposta":"A resposta correta é: a computação em grade.."},{"pergunta":"Realize a associação com os itens relacionados abaixo:\n\n","imagem":"","alternativas":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial.\n\nResposta 1 \nDesenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico\n\nResposta 2 \nZ80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits)\n\nResposta 3 \nCamada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.)\n\nResposta 4 \n","resposta":"A resposta correta é: Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem completos, fugindo ao conceito inicial. → Sistemas embarcados, Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico → ARM, Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) → video-games, DVDs, Palms, injeção eletrônica, etc., Camada de Hardware, Gráficos e output (touchscreen, impressoras, LEDs, etc.) → Arquitetura Conceitual."},{"pergunta":"O primeiro Sistema Embarcado produzido em massa foi o:\n\n","imagem":"","alternativas":"Escolha uma:\na. Autonetics D-17 – Computador guia do míssil Minuteman \nb. Autoclick– Processador para controle de teclado da IBM\nc. Autotronic – Computador guia de automóveis\nd. Autonet– Computador guia de roteadores para Internet\n","resposta":"A resposta correta é: Autonetics D-17 – Computador guia do míssil Minuteman."},{"pergunta":"A respeito das similaridade entre Grid e Cluster, é incorreto afirmar que:\n\n","imagem":"","alternativas":"Escolha uma:\na. Essas duas técnicas atendem a mesma abrangem geográfica.\nb. Essas duas técnicas buscam aumentar a eficiência e o rendimento por meio de redes de computadores.\nc. Ambas as técnicas envolvem a solução de problemas de computação que não estão no escopo de um único computador, conectando computadores. \nd. Essas duas técnicas economizam dinheiro porque conseguem otimizar os recurso.\n","resposta":"A resposta correta é: Essas duas técnicas atendem a mesma abrangem geográfica.."},{"pergunta":"A respeito de ARM (Advanced RISC Machine), qual afirmação abaixo não é verdadeira:\n\n","imagem":"","alternativas":"Escolha uma:\na. Utilizados em gadgets compactos (smartphones, tablets, roteadores e calculadoras).\nb. Desenvolvida para oferecer boa performance sem aumentar o gasto energético ou o tamanho físico.\nc. Possui recursos de hardware reduzido em relação aos computadores tradicionais.\nd. Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final. \n","resposta":"A resposta correta é: Utiliza preferencialmente sistemas baseados em Windows, para melhorar a interface com o usuário final.."},{"pergunta":"Em uma Grid Computing são empregados no processo milhares de sistemas computacionais. Todos os dispositivos que têm poder de computação como desktops, laptops, tablets, celulares, supercomputadores, mainframes, servidores e sensores meteorológicos são conectados para formar uma única rede. Para realizar a função \"Grid\" todos estão conectados usando apenas uma rede local.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"A respeito da OMAP (Open Multimedia Applications Platform), qual item abaixo não é verdadeiro:\n\n","imagem":"","alternativas":"Escolha uma:\na. Desenvolvida para baixo desempenho. \nb. Possui baixo consumo de energia.\nc. Faz parte da Família de processadores com arquitetura dual core (ARM + DSP(Digital Signal Processing))\nd. Desenvolvida para alto desempenho.\n","resposta":"A resposta correta é: Desenvolvida para baixo desempenho.."},{"pergunta":"Das afirmações sobre Grid, qual está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. Quando estamos resolvendo um problema que requer muito processamento de CPU ou acesso a um enorme repositório de dados, usamos a computação em grade.\nb. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum. \nc. Embora a grade conecte várias plataformas diferentes, ela pode ser acessada a partir de um único navegador da web, por exemplo.\nd. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.\n","resposta":"A resposta correta é: No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.."},{"pergunta":"Alguns processadores antigos ainda são amplamente utilizados, como o Z80 (8 bits), Motorola 68000 (16 bits) e os chips ARM (32 bits) na construção de videogames, DVDs, Palms, injeção eletrônica, etc.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Nos itens abaixo escolha o que não se relaciona a Camada de Hardware de uma arquitetura conceitual embarcada:\n\n","imagem":"","alternativas":"Escolha uma:\na. Memória ROM\nb. Processador Embarcado\nc. Memória RAM\nd. Interface IDE \n","resposta":"A resposta correta é: Interface IDE."},{"pergunta":" A respeito de Cluster, qual afirmação está incorreta:\n\n","imagem":"","alternativas":"Escolha uma:\na. No processamento paralelo, utilizamos o poder de processamento de duas ou mais CPUs ao mesmo tempo para atingir uma meta de computação comum.\nb. Na tolerância a falhas, temos um sistema que é robusto o suficiente para lidar com falhas de hardware ou software. Mesmo se um nó falhar, a operação pode ser concluída por outros nós. O poder de computação do cluster é afetado quando um sistema está com falha, mas, no entanto, outros sistemas ainda estão disponíveis para executar a operação.\nc. No balanceamento de carga, distribuímos tarefas de computação pelo cluster, de modo que uma única máquina não seja sobrecarregada com um processamento pesado que não pode ser feito.\nd. Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver. \n","resposta":"A resposta correta é: Quando o problema a ser resolvido não está dentro da capacidade de um único computador, se aproveita a capacidade ociosa de outros computadores para resolver.."},{"pergunta":"A tendência para os sistemas embarcados é a adição de mais inteligência a processos e produtos, e maior conectividade, através de tecnologias de rede sem fio, por exemplo.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Um AGC (Automatic Gain Control), pode ser considerado um sistema embarcado de pequena capacidade, ele foi utilizado inicialmente como um sistema de controle:\n\n","imagem":"","alternativas":"Escolha uma:\na. no Primeiro carro da Ford\nb. na Estação espacial russa\nc. na Apollo \nd. no Big-Ben\n","resposta":"A resposta correta é: na Apollo."},{"pergunta":"O mercado de embarcados é aproximadamente 2 vezes maior que o de Desktops e deve diminuir exponencialmente na próxima década.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Alguns sistemas, como celulares, Palms, PDAs e TV Digital, estão se tornando bem mais completos, fugindo ao conceito inicial de um sistema embarcado.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro \nFalso\n","resposta":"A resposta correta é 'Verdadeiro'."},{"pergunta":"Na computação em cluster, conectamos um grupo de 2 ou mais computadores de forma que eles trabalhem em conjunto como varias unidade de computação para resolver um problema comum de computação.\n\n","imagem":"","alternativas":"Escolha uma opção:\nVerdadeiro\nFalso \n","resposta":"A resposta correta é 'Falso'."},{"pergunta":"Um computador com um conjunto complexo de instruções (CISC) tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Muitas operações e Diferentes formatos e comprimentos de instruções \nb. Muitas operações e Diferentes formatos e comprimentos de programas\nc. Poucas operações e Diferentes formatos e comprimentos de instruções\nd. Muitas operações e idênticos formatos e comprimentos de instruções\n","resposta":"A resposta correta é: Muitas operações e Diferentes formatos e comprimentos de instruções."},{"pergunta":"Um computador com um conjunto reduzido de instruções (RISC), tem como principais características:\n\n","imagem":"","alternativas":"Escolha uma:\na. Número maior de instruções e Mais Eficiência\nb. Número reduzido de instruções e Menos Eficiência\nc. Número reduzido de instruções e Mais Eficiência \nd. Número maior de instruções e Menos Eficiência\n","resposta":"A resposta correta é: Número reduzido de instruções e Mais Eficiência."}]